{
 "harry potter": {
  "link": "https://harrypotter.fandom.com/wiki/Talk:Harry_Potter",
  "summary": "What she said was; \"Impressive\", said Madam Bones, staring down at him, \"a true Patronus at that age... very impressive indeed.\" (Harry Potter and the Order of the Phoenix)  considering the vast majority of wizards and witches can't even produce a tangable one. It says here on the wiki on the page dedicated to the charm that \"any form of Patronus, and to create an intangible one is generally considered a sign of great magical power\". in my opion that's why the majority of the wizarding work can't produce a Patronus because very powerful aren't the norm. In the Prisoner of Azkaban whan Harry cast his Patronus to drive away the hundards of Demintors it was said that \"it must have been a really powerful wizard to drive away all those dementores away\" (Hermione Granger). Another sign of prove is during the Battle of Hogwarts when Luna, Ernie, and Seamus cast their Patronus's the dementors didn't scatter but, whan Harry cast his \"the dementors scattered in earnest.\" not everyone could cast a Patronus that was in the D.A."
 },
 "cassandra vole": {
  "link": "https://harrypotter.fandom.com/wiki/Cassandra_Vole",
  "summary": "[6]\nShe overheard Daniel speaking to a friend one day about how he thought hiding magic from Muggles was wrong. Cassandra began teasing Daniel, asking if he wanted to be in the paper or be a criminal. [6]\nCassandra worked out that he had a Muggle in the Page family, and he told her to shut up. Daniel's friend didn't think Cassandra was worth it, and Ivy Warrington asked if she didn't like non-magic people. Cassandra told her she did, because she had an uncle who was a Muggle and she thought he was hilarious. [6]\nCassandra left, but Ivy run after her and started duelling her. [6]\nLater that evening, Cassandra, Colby and Fischer Frey snuck out to the Library."
 },
 "chris columbus": {
  "link": "https://harrypotter.fandom.com/wiki/Chris_Columbus",
  "summary": "[1] They have four children together, Eleanor, Violet, Isabella and Brendan. His wife Monica made a small appearance in Home Alone as the red-headed flight attendant, and in Home Alone 2 as the Plaza telephone operator. Columbus lives in San Francisco's Pacific Heights, where his children attend or previously attended Saint Ignatius College Preparatory."
 },
 "harry potter hogwarts mystery": {
  "link": "http://harrypotter.fandom.com/wiki/Harry_Potter:_Hogwarts_Mystery",
  "summary": "In this game, the player creates their own character and takes on the role of a Hogwarts student. [6] The game is still under development, as some chapters of Year 7 and Quidditch Season 3, and the entirety of Quidditch Season 4 are still not released. Several actors voiced characters that they had played in the Harry Potter films before, including Warwick Davis, Michael Gambon, Maggie Smith, Gemma Jones, Zoë Wanamaker, and Sally Mortemore. [2][8]\nThe player creates a character and follows the story of a student at Hogwarts School of Witchcraft and Wizardry, and throughout the game will have to make certain choices that determine the path their character will be placed on, including the kind of relationships they build with other characters. In that time, the game will feature characters known from the books during their student years, including Bill Weasley, Charlie Weasley, and Nymphadora Tonks. [7] The game also features teachers who were working at Hogwarts during that time including the characters of Rubeus Hagrid, Severus Snape, Minerva McGonagall,[7] Albus Dumbledore, Filius Flitwick, and Rolanda Hooch. Cedric Diggory was mentioned by his father, that he would be joining Hogwarts as a first-year student by the time the player reaches year 6. The answers they give from a maximum of three possible answers can determine which wand they receive, how strong their friendship with another character will be or how to deal with a situation that could have an impact on them later in the story."
 },
 "administrators": {
  "link": "https://harrypotter.fandom.com/wiki/Harry_Potter_Wiki:Administrators",
  "summary": "Administrators, also called sysops, are active and regular users who have access to technical features that help with maintenance. Among them are watching the Articles for deletion debates and carrying out the consensus of the community on keeping or deleting these articles, keeping an eye on new and changed articles to swiftly delete obvious vandalism, and meeting user requests for help that require administrative access. Since administrators are expected to be experienced members of the community, users seeking help will often turn to an administrator for advice and information."
 },
 "quidditch through the ages real": {
  "link": "https://harrypotter.fandom.com/wiki/Quidditch_Through_the_Ages_(real)",
  "summary": "Quidditch Through the Ages is a book written, hand-lettered and illustrated by J. K. Rowling for the Comic Relief U.K. charity in 2001. Written under the pseudonym Kennilworthy Whisp, it is meant to be a copy of the in-universe book Quidditch Through the Ages. It features a blurb and a foreword by Albus Dumbledore, in which he stresses the only way he was able to take it from Irma Pince—Librarian of the Hogwarts Library—was to \"prise her fingers individually from the spine.\" The first page is meant to look like a library borrowing log, which features the names of many Hogwarts Quidditch players. The name H. Granger appears near the bottom, as she took it out in Harry Potter and the Philosopher's Stone, before the first broom riding lesson. Wood, B. Dunstan, M. Flint, C. Diggory, A. Johnson, E. Macmillan, T. Boot, S. Fawcett, K. Bundy, K. Bell, C. Warrington, J. Dorny, T. Nott, S. Capper, M. Bulstrode, F. Weasley, and H. Potter. However, in the 2009 UK edition, these dates are changed and names are listed in the library borrowing log, in this order: R. Weasley, N. Longbottom, S. Bones, H. Granger, Padma Patil, E. Macmillan, M. Bulstrode, H. Granger (again), and Draco Malfoy. [3]\nThe copyright page features Praise for Quidditch Through the Ages, with commentary by wizarding celebrities Bathilda Bagshot, Brutus Scrimgeour, Gilderoy Lockhart, Ludo Bagman, Rita Skeeter, and the Editor of Which Broomstick."
 },
 "lego creator harry potter": {
  "link": "https://harrypotter.fandom.com/wiki/LEGO_Creator:_Harry_Potter",
  "summary": "One explores four different \"worlds\": Diagon Alley, King's Cross Station, Hogwarts grounds, and the inside of Hogwarts. There are also many mini-worlds, such as Hagrid's Hut, the Gryffindor Common Room, Potions Classroom, third-floor corridor and Underground Chambers. These models are all based upon the Harry Potter and the Philosopher's Stone LEGO sets. In addition to building, one can control characters, cast spells, and change the weather. Upon completion of each challenge, the game will sometimes show a cutscene, and unlock a new spell to use. There is a narrator character to guide and aid the player throughout the game, who is an elderly looking wizard with grey hair, red clothing and a purple wand."
 },
 "unidentified muggleborn hogwarts student": {
  "link": "http://harrypotter.fandom.com/wiki/Unidentified_Muggle-born_Hogwarts_student",
  "summary": "After being informed of their magical heritage by Rubeus Hagrid, they started attending Hogwarts School of Witchcraft and Wizardry in 2008. [1] During their childhood, their latent magical abilities often surfaced, which they believed was unusual, despite their parents being amused and not taking it seriously. [2]\nDuring the summer of 2008,[1] Rubeus Hagrid, the Keeper of Keys and Grounds at Hogwarts School of Witchcraft and Wizardry, paid them a visit and delivered the Hogwarts acceptance letter. They first went to Madam Malkin's Robes for All Occasions to dress themselves up,[2] and then Ollivanders to purchase their wand. [7]\nWhen they arrived at King's Cross Station on 1 September, they were unsure how to find Platform Nine and Three-Quarters. [8]\nHeadmistress McGonagall led them into the Great Hall and delivered a speech, mentioning a grumpy ghoul having taken up residence in an empty classroom on the third floor, and assuring students that while they would hopefully never face such evil as in the Battle of Hogwarts, should challenges arise, the joint forces of them would be truly powerful."
 },
 "daniel page": {
  "link": "http://harrypotter.fandom.com/wiki/Daniel_Page",
  "summary": "[1] He was the third child and youngest son of a Muggle father and a witch mother, and was raised alongside an older brother and sister. The only one of the two boys to possess magical ability, Daniel nevertheless attended a Muggle primary school prior to receiving his letter of acceptance from Hogwarts. While apparently loving, Daniel's childhood were still marred by controversy from an early age, marked by the illicit activities of their father and, in due time, also Daniel's older brother Reggie, who was a Squib. [2]\nHaving \"tried to help\" using magic but only ended up \"scaring a bunch of Muggles\", Daniel's mother was also apprehended. While her two apparent accomplices were both tried and sentenced to a Muggle prison, her violation of the International Statute of Wizarding Secrecy came to the attention of the Ministry of Magic, which, presumably through the efforts of the Muggle Liaison Office, successfully claimed jurisdiction and had her released into the custody of the Department of Magical Law Enforcement. The family's arrest was covered by a Muggle newspaper, dubbing them \"The Bloody Pages\", after which Daniel, who was now left in the care of his older sister, found school to be anything but fun. [2]\nUpon arriving at school, Daniel came off as a solitary, studious young wizard that often preferred focusing on his academics over interacting with other people. Following his mother's imprisonment after her violation of the International Statute of Wizarding Secrecy, he grew to view it as a \"stupid law\", and expressed the belief that while they should not necessarily go around flaunting their abilities to the masses, he nevertheless believed that keeping magic from the Muggle world entirely as a selfish thing to do, apparently blind to the extent to which permitting magic around non-wizards could be exploited for nefarious purposes."
 },
 "draco malfoy": {
  "link": "http://harrypotter.fandom.com/wiki/Draco_Malfoy",
  "summary": "During his years at Hogwarts, he became friends with Vincent Crabbe, Gregory Goyle, Pansy Parkinson, and other fellow Slytherins, but he quickly developed a rivalry with Harry Potter. Lord Voldemort charged Draco with making up for Lucius's failure, and he became a Death Eater at age sixteen but was quickly disillusioned with the lifestyle. Draco Lucius Malfoy was born on 5 June 1980, to Lucius and Narcissa Malfoy (née Black),[12] who were both born into old, wealthy pure-blood families. Both the Malfoys' and the Blacks had traditionally been in Slytherin House for centuries and strongly disapproved of any relatives who did not follow in this tradition, such as Sirius Black. [13]\nDraco was raised in an atmosphere of regret that the Lord Voldemort had not succeeded in taking command of the wizarding community, although he was prudently reminded that such sentiments ought not to be expressed outside the small circle of the family and their close friends 'or Daddy might get into trouble'. The Malfoys' were very proud of their Pure-blood and social status; until 1996, they were able to maintain a respectable public image while being allied with Lord Voldemort. Lucius was a Death Eater who avoided imprisonment in Azkaban following the First Wizarding War by claiming that he had been under the Imperius Curse, while Narcissa merely agreed with the ideology of pure-blood supremacy."
 },
 "lego dimensions": {
  "link": "https://harrypotter.fandom.com/wiki/LEGO_Dimensions",
  "summary": "[1]\nThe Fantastic Beasts story pack includes six levels that cover the plot of the film albeit in a form edited both for brevity and comedic effect. The Harry Potter Team Pack gives access to the Harry Potter open world that contains locations such as 12 Grimmauld Place, Hogsmeade, and Hogwarts Castle. These locations are not as extensive or complete as their implementation in the earlier LEGO Harry Potter: Years 1-4 and LEGO Harry Potter: Years 5-7 video games. Voldemort also appears in the LEGO Batman Movie Story Pack as one of the villains that The Joker frees from the Phantom Zone, and serves as that story's final boss."
 },
 "harry potter and the deathly hallows part 1 video game": {
  "link": "https://harrypotter.fandom.com/wiki/Harry_Potter_and_the_Deathly_Hallows:_Part_1_(video_game)",
  "summary": "It was produced by EA Games,[1] and was released on 16 November, 2010 in the U.S., and on 19 November, 2010 in the U.K.[2] The game was announced at E3 2010. [3] The game was rated E10+ (Everyone 10 and up) on the Nintendo DS, and T (Teen) on all other platforms in the U.S. Harry Potter, Ronald Weasley, and Hermione Granger must venture out into the Wizarding World on their own to destroy Lord Voldemort's remaining Horcruxes. It is an action video game, not a video game of making potions, playing Quidditch or exploring Hogwarts. There is no RPG iteration of the game, unlike with previous titles. Unlike the previous instalments, there is not much room to \"run around\" such as in the fifth and sixth game, where you were allowed to move freely within the castle and on the grounds. Unlike previous titles where you rarely fought Death Eaters, you will fight hundreds of them, as well as Snatchers, in this game. Along with said Death Eaters, you can also fight creatures, such as Giant Spiders, Dragons, Doxies, Whomping Willows, and Dementors."
 },
 "omar abasi": {
  "link": "https://harrypotter.fandom.com/wiki/Omar_Abasi",
  "summary": "Omar Abasi was a wizard who worked as a healer at St Mungo's Hospital for Magical Maladies and Injuries, working on the first floor and tended to patients suffering from creature-induced Injuries, an area at which he was an expert. [1]\nAt some point in his life, Omar successfully underwent the required tutelage to become a fully-fledged Healer and were eventually successful at obtaining a position at St Mungo's Hospital for Magical Maladies and Injuries in London, where he worked in the \"Dangerous\" Dai Llewellyn Ward for Serious Bites on the first floor, specialising in creature-induced injuries. [2]\nAt some point in his career, Omar was drafted in for conjecture by the Beast Division in the Department for the Regulation and Control of Magical Creatures at the Ministry of Magic, wherein he would lend its investigators his expertise and give his opinion on cases they were working on. [2]\nHis observation was indeed correct, as the investigators from the Department for the Regulation and Control of Magical Creatures discovered Mr Horton had been attacked by a Hippogriff."
 },
 "alfonso cuarn": {
  "link": "http://harrypotter.fandom.com/wiki/Alfonso_Cuar%C3%B3n",
  "summary": "28 November, 1961 in Mexico City, Mexico) is a Mexican film director. He directed the third Harry Potter film in the successful Harry Potter series, Harry Potter and the Prisoner of Azkaban. Prior to directing the series, he had not read any of the books within the series and did not consider the idea of doing a \"big special effects film\" to be on his radar. [2]\nCuarón made a great many changes to the Harry Potter film series, all of which were met with either great acclaim or stiff opposition by Harry Potter fans. Many caused serious continuity errors in relation to the previous two films, which were directed by Chris Columbus. These include Cuarón's changing the appearance and layout of Hogwarts Castle, by adding the Clock Tower, the Central tower and changing the location of Hagrid's Hut. When he was first signed on, he asked Emma Watson, Daniel Radcliffe and Rupert Grint to write a short essay on their characters. After graduating, Cuarón began working in television in Mexico, first as a technician and then as a director. Cuarón's television work led to assignments as an assistant director for several Latin American film productions (including Gaby: A True Story and Romero), and in 1991, he landed his first big-screen directorial assignment. Solo con tu pareja was a dark comedy about a womanising businessman who learns he's contracted AIDS; the film was a massive hit in Mexico, and was enthusiastically received around the world."
 },
 "harry potter and the halfblood prince video game": {
  "link": "https://harrypotter.fandom.com/wiki/Harry_Potter_and_the_Half-Blood_Prince_(video_game)",
  "summary": "The game was released on 30 June, 2009, on the Mac OS X, Microsoft Windows, Nintendo DS, PlayStation 2, PlayStation 3, PlayStation Portable, Wii, and Xbox 360 platforms. In Harry Potter and the Half-Blood Prince, Dumbledore prepares Harry for the final battle that he knows is fast approaching as Voldemort is tightening his grip on both the Muggle and wizarding worlds. Together they work to find the key to unlock Voldemort's defences and, to this end, Dumbledore recruits his old friend and colleague, the well-connected and unsuspecting bon vivant Professor Horace Slughorn, whom he believes holds crucial information about Voldemort's power. The game utilises the Wii Remote features as it did in the Harry Potter and the Order of the Phoenix video game.[1]. The steps include picking up vials of liquid, shaking them (by shaking the Wii Remote) until they froth, and tipping the Wii Remote to pour it into the mixture, being very careful not to pour in too much. [2]\nHarry Potter can duel against Draco Malfoy in a Duelling Room with a long platform, similar to the one seen in the second film, but wider to allow dodging of spells. Moving in order to dodge is done with the Nunchuk Control Stick, while casting spells is done with Wii Remote and Nunchuk gestures. Combat spells currently implemented include a shield spell (\"Protego\") cast by crossing the Wii Remote and Nunchuk, a standard attack spell by striking downwards with the Wii Remote (\"Stupefy\"), a charged version by holding the Wii Remote up for longer first, and a more powerful attack spell by swinging the Wii Remote and Nunchuck to the left."
 },
 "david yates": {
  "link": "http://harrypotter.fandom.com/wiki/David_Yates",
  "summary": "His first two Potter films became the highest-grossing entries in the series after the first instalment, which was later surpassed by Yates's Deathly Hallows, making him the most commercially successful British director in recent years. [2][3][4]\nYates achieved international attention for his award-winning short films early in his career and is known for directing several television films and dramas, such as the critically acclaimed BBC political thriller State of Play and the BAFTA-lauded two-part drama Sex Traffic. [5][6]\nAmong various awards, Yates has had success at the BAFTA Awards, Emmy Awards and has been acknowledged at the Saturn Awards. [7][8][9]\nDavid Yates was born in St Helens, England in 1963. From an early age he was fascinated with the works of film directors, with Steven Spielberg's 1974 film Jaws and the 1951 film The Thing from Another World being two favourites in particular. [10][11]\nLiving in Swindon in the 1980s, Yates became a freelancer for Create Studios whose facilities helped him make his first serious film, When I Was a Girl. When I Was a Girl also marked Yates’ entry into the UK’s entertainment industry, with the BBC hiring him to make the dramatic short Oranges and Lemons in 1991."
 },
 "harry potter and the deathly hallows": {
  "link": "http://harrypotter.fandom.com/wiki/Harry_Potter_and_the_Deathly_Hallows",
  "summary": "Harry Potter and the Deathly Hallows is the seventh and final book in the Harry Potter series by J. K. Rowling. It was released on 21 July, 2007 at 00:01 am local time in English-speaking countries. It is followed by a sequel to the original series, Harry Potter and the Cursed Child. The title was first released to the public through a hangman game posted by J. K. Rowling on her official website on December 21, 2006. Rowling left a note, written on a bust of Hermes in her room at the Balmoral Hotel in Edinburgh, saying, \"JK Rowling finished writing Harry Potter and the Deathly Hallows in this room (652) on 11th Jan 2007\". On her website she said, \"While each of the previous Potter books has strong claims on my affections, Deathly Hallows is my favourite, and that is the most wonderful way to finish the series.\" She has previously said that although all the books carry on the story, Deathly Hallows is more a continuation of the story in the previous book, Harry Potter and the Half-Blood Prince, than has been the case with any other book in the series. It is the fastest-selling book of all time, selling 20 million copies in the first 24 hours. [1][2]\nThe \"seven-way split\" refers to some of those with whom Jo has shared her life while writing Harry:\nHarry is waiting in Privet Drive."
 },
 "ralph fiennes": {
  "link": "https://harrypotter.fandom.com/wiki/Ralph_Fiennes",
  "summary": "In 2001, Fiennes received the William Shakespeare Award from the Shakespeare Theatre in Washington, D.C.\nFiennes made his film debut in 1992 as Heathcliff in Wuthering Heights opposite Juliette Binoche, for which he received substantial acclaim and praise throughout Europe. But it was in the following year that he became known internationally, portraying the amoral Nazi concentration camp commandant Amon Göth in Steven Spielberg's Schindler's List, for which he was nominated for the Academy Award for Best Supporting Actor. In 1994, he portrayed American academic Charles Van Doren in Quiz Show, and in 1996, he was nominated for the Academy Award for Best Actor for the World War II epic romance The English Patient. Fiennes' work has ranged from thrillers (Red Dragon (film), (Harry Potter) to animated Biblical epic (The Prince of Egypt) to campy nostalgia (The Avengers ) to romantic comedy (Maid in Manhattan) and offbeat dramedy (Oscar and Lucinda). In 2002, Fiennes and Miranda Richardson received several awards for their performances in David Cronenberg's award-winning thriller Spider. [1]\nThe Constant Gardener (film) was released in 2005, with Fiennes as the title role. Brendan Gleeson, who plays Mad-Eye Moody, also was featured in the film along with Clemence Poesy, who acts as Fleur Delacour in the film adaptations of Harry Potter."
 },
 "harry potter book series": {
  "link": "https://harrypotter.fandom.com/wiki/Harry_Potter_(book_series)",
  "summary": "The Harry Potter books make up the popular series written by J. K. Rowling. The books concern a wizard called Harry Potter and his journey through Hogwarts School of Witchcraft and Wizardry. The first book, Harry Potter and the Philosopher's Stone, was published in 1997 by Bloomsbury in London. The last book, Harry Potter and the Deathly Hallows, sold more than 12 million copies in the U.S.\nBeginning on 6 October 2015, the entire series was presented in a fully-illustrated format, with over 100 illustrations per title, by Jim Kay. It is said that J. K. Rowling sent her preliminary copy of Harry Potter and the Philosopher's Stone to 12 publishers before it was accepted and published by Bloomsbury. The author published seven books in the Harry Potter series, as well as numerous complementary books. You can get all seven eBooks as one download on  Pottermore with Harry Potter: The Complete Collection. A sequel to the original series, Harry Potter and the Cursed Child was released July 31st, 2016. The following is a list of the seven books in the Harry Potter Series."
 },
 "fantastic beasts and where to find them film": {
  "link": "http://harrypotter.fandom.com/wiki/Fantastic_Beasts_and_Where_to_Find_Them_(film)",
  "summary": "Fantastic Beasts and Where to Find Them (or simply Fantastic Beasts) is the first prequel of a series of films based on Fantastic Beasts and Where to Find Them, one of the companion books to J. K. Rowling's Harry Potter series. [6] David Heyman, who produced the Harry Potter films, returned as producer for Fantastic Beasts. [2]\nThe film is set in New York in 1926, sixty-five years before the Harry Potter series, and features Newton Scamander as a main character. [7] Fantastic Beasts and Where to Find Them tells us that Scamander had been travelling the world in research of magical creatures since 1918, culminating with the publication of his masterpiece in 1927. [3] Upon returning to Harry Potter for the first time since 2007, Rowling commented: \"I always said that I would only revisit the wizarding world if I had an idea that I was really excited about and this is it. \"[3] She stated that the idea of seeing Scamander \"realised by another author was difficult,\" hence her decision to be the film's screenwriter. [8]\nPart of the synopsis for the film was first revealed on 6 October, 2014, when J. K. Rowling posted the cryptic message \"Cry, foe!"
 },
 "mathilda grimblehawk": {
  "link": "http://harrypotter.fandom.com/wiki/Mathilda_Grimblehawk",
  "summary": "[4] She presumably also took and excelled in Care of Magical Creatures, given her future career as a Magizoologist. [5]\nAfter she left school, she eventually joined the Ministry of Magic, where she became an investigator for the Beast Division. [6] She believed the Cannons to be the best Quidditch team in the league, despite their performance last season. [7]\nOther cases on which she worked included the disruption at the Leaky Cauldron,[8] the attack on Don Harrison's construction crew,[9] the story from the Siren's Rest's landlord of a Welsh lake monster,[10] the disappearance of Bilius Finbok,[11] the investigation in the sewers of London,[12] and the fire at Hogwarts School of Witchcraft and Wizardry. [13]\nAccording to Gethsemane Prickle, she once, during the course of her duties, decided she would taste a Draught of Living Death before administering it to a magical creature. [14]\nBy 2018, Mathilda was working with the newly-created Statute of Secrecy Task Force to aid them in dealing with the results of the Calamity."
 },
 "harry potter and the chamber of secrets video game": {
  "link": "http://harrypotter.fandom.com/wiki/Harry_Potter_and_the_Chamber_of_Secrets_(video_game)",
  "summary": "The video game Harry Potter and the Chamber of Secrets was released on 15 November, 2002, the same day as the film adaptation, developed by KnowWonder, Eurocom, EA UK, Argonaut, and Griptonite Games (varies by platform) and published by Electronic Arts. [1]\nFive different versions of this game were released for different gaming platforms:\nNote: not all characters appear in all versions of the game. Likewise, there is also a cheat code for the Game Boy Advance version that also presents its own debug menu."
 },
 "fantastic beasts film series": {
  "link": "http://harrypotter.fandom.com/wiki/Fantastic_Beasts_(film_series)",
  "summary": "[6][7][8]\nAccording to Eddie Redmayne, who said this information came from director David Yates and producer David Heyman, the titles of each film in the series would begin with \"Fantastic Beasts and …\". [9] This seems to no longer be the case beginning with the second film, which uses a colon instead. The plot of the first film revolves around Newton Scamander, or commonly known as Newt, a Magizoologist who arrives in New York in December of 1926, to stay for a brief time following a journey around the world to research creatures for his book Fantastic Beasts and Where to Find Them. When some of the creatures escape, the situation threatens the secrecy of the Wizarding world and the relationship between the magical and non magical societies in America, which is already in danger due to the New Salem Philanthropic Society. Newt battles to find the creatures with the help of Jacob and Porpentina \"Tina\" Goldstein before it's too late, with Percival Graves on his tail. [11] It begins to centre around Gellert Grindelwald, who made a brief appearance in the first film and was considered the darkest Wizard of his time. [12]\nThe third film is going to be set in Rio de Janeiro, China, and Germany."
 },
 "harry potter and the deathly hallows part 2": {
  "link": "https://harrypotter.fandom.com/wiki/Harry_Potter_and_the_Deathly_Hallows:_Part_2",
  "summary": "[3] The first part was released internationally on November 18, 2010 and the following day in the United Kingdom and the United States, with the second released on 13 July 2011. [4] Production of the two films occurred concurrently,[5] and treated as if it were one film. [6] The idea to split the films had been around since the middle of 2007,[3] but only really came into serious consideration after producer David Heyman was able to talk to writer Steve Kloves when the 2007–2008 Writers Guild of America strike ended and Heyman had Rowling's approval. [6]\nOn 12 March 2008, Warner Bros. additionally confirmed that the film would be split into two, to do justice to the book. [7] David Yates, director of Order of the Phoenix and Half-Blood Prince will return to direct and Steve Kloves is going to write the screenplay. \"[5] Heyman described the workings behind the split: \"Deathly Hallows is so rich, the story so dense and there is so much that is resolved that, after discussing it with Rowling, we came to the conclusion that two parts were needed. [8]\nBefore David Yates was officially chosen to direct the film, others had expressed an interest in the job. [9]Guillermo del Toro, who passed on Prisoner of Azkaban, had expressed interest in directing Deathly Hallows,[10] but an increased workload ruled him out of the project. [12]Daniel Radcliffe said: \"This is a road film, particularly in Part One of the film."
 },
 "harry potter wizards unite": {
  "link": "https://harrypotter.fandom.com/wiki/Harry_Potter:_Wizards_Unite",
  "summary": "On 16 April 2019, a beta version was released in New Zealand for Android and iOS devices. [3] Originally due to release on 21 June 2019, the game was released a day early on 20 June 2019. [4]\nOn 2 November 2021, Niantic announced that the game will be shutdown on 31 January 2022, and that the game will be removed from all app stores on 6 December 2021, and in-game purchases will not be able to be made after 6 December. [5][6]\nWhen unpredictable traces of magic appear all over the Muggle world, the wizarding world faces potential exposure. As an AR game, the main aspect of the game is to interact with the real world, which is provided by a map of the player's location. [3] In this version, all features presented in the game are playable, although some content is not yet available. The other objects the player can encounter are Foundables, which can be a variety of things: wizards, creatures, items, memories and so on. The Registry is divided into four categories and display the captured Foundables:\nOn the map, the player can see their own character, various locations, Foundables and random potion ingredients."
 },
 "harry potter magic awakened": {
  "link": "https://harrypotter.fandom.com/wiki/Harry_Potter:_Magic_Awakened",
  "summary": "The game was developed by Warner Bros. and NetEase under the Portkey Games umbrella and was first announced on 30 October, 2019. [1] It will be released in the winter in Thailand, Philipines, Malaysia, Singapore, Indonesia, Japan, and South Korea. Ten years after Harry Potter's legendary victory over Lord Voldemort at the Battle of Hogwarts,[3] a young Muggle-born receives an unexpected visit from a giant of a man by the name of Rubeus Hagrid, who has come to deliver their letter of acceptance to attend Hogwarts School of Witchcraft and Wizardry. Upon arriving, however, a mystery begins to unfold on the grounds when one of the first years, Ivy Warrington, goes mysteriously missing after the Sorting Ceremony. Players will be able to customise their character, select their Hogwarts House, attend lessons, explore Hogwarts, and join the Duelling Club."
 },
 "severus snape": {
  "link": "http://harrypotter.fandom.com/wiki/Severus_Snape",
  "summary": "Severus Snape (9 January, 1960[1] – 2 May, 1998)[2] was an English half-blood[3] wizard serving as Potions Master (1981-1996), Head of Slytherin House (1981-1997), Defence Against the Dark Arts professor (1996-1997), and Headmaster (1997-1998) of the Hogwarts School of Witchcraft and Wizardry as well as a member of the Order of the Phoenix and a Death Eater. The only child of Muggle Tobias Snape and Gobstones witch Eileen Snape (née Prince), Severus was raised in the Muggle dwelling of Spinner's End, which was in close proximity to the home of the Evans family, though in a poorer area. [7]\nSeverus started at Hogwarts with Lily in 1971, where he was Sorted into Slytherin House. [6][7] In an attempt to win back Lily's affections,[18] Snape joined the Death Eaters along with a group of his fellow Slytherins. [19]\nShortly before Lily Evans was murdered by Lord Voldemort, Snape changed sides and became a member of the Order of the Phoenix as well as a double agent during the Second Wizarding War."
 },
 "penny haywood": {
  "link": "https://harrypotter.fandom.com/wiki/Penny_Haywood",
  "summary": "Penny was born in London, United Kingdom in 1972 or 1973, to a Muggle father[7] and a Muggle-born witch mother. [8] She had a younger sister named Beatrice,[1] born four years after her. [9]\nPenny's family spent every summer in the countryside, where she also had a Muggle friend called Scarlett. [1]\nAt some point in her childhood, her family lived in Wigtown, which lead to Penny becoming a lover of the Quidditch team Wigtown Wanderers. [5]\nIn 1984, she began attending Hogwarts School of Witchcraft and Wizardry and was sorted into Hufflepuff. [10] She later befriended Jacob's sibling and helped them create the Sleeping Draught they needed to break into the locked room, where they were looking for the Cursed Vaults. [11]\nDuring the Hallowe'en Feast[12], she offered to help Jacob's sibling look for Dumbledore. Although obviously terrified, she refused to leave Jacob's sibling's side until they begged her to run."
 },
 "fantastic beasts and where to find them companion book": {
  "link": "https://harrypotter.fandom.com/wiki/Fantastic_Beasts_and_Where_to_Find_Them_(real)",
  "summary": "Written under the pseudonym Newt Scamander, it is meant to be a copy of the in-universe book Fantastic Beasts and Where to Find Them. Throughout the editions prior to 2017 are hand-written comments by Ron Weasley, Hermione Granger and Harry Potter, as well as a blurb and foreword by Albus Dumbledore. To mark the release of the 2016 Fantastic Beasts and Where to Find Them film, three new book covers were designed by  Pottermore, Bloomsbury and Scholastic, and Rowling added new information. There is also an audio book edition narrated by Eddie Redmayne, who portrays the author Newt Scamander in the film adaptations. [1]\nFantastic Beasts and Where to Find Them can also be bought in a bulk set with Quidditch Through the Ages and The Tales of Beedle the Bard. When the book was published in 2001, it contained creatures that had yet to appear in the later books."
 },
 "ronald weasley": {
  "link": "https://harrypotter.fandom.com/wiki/Ronald_Weasley",
  "summary": "1 March, 1980) was an English pure-blood[2] wizard, the sixth and youngest son of Arthur and Molly Weasley (née Prewett). Together, they made the Golden trio, they faced many challenges during their adolescence, including keeping the Philosopher's Stone from Professor Quirinus Quirrell, rescuing Ginny from the Basilisk of the Chamber of Secrets, saving Harry's godfather Sirius Black from the Dementors of Azkaban, guiding Harry through the Triwizard Tournament, forming Dumbledore's Army and fighting in numerous battles of the Second Wizarding War: including the Battle of the Department of Mysteries (1996), Battle of the Astronomy Tower (1997), and Battle of the Seven Potters (1997). He skipped his last year of school in order to accompany Harry and Hermione on a hunt to destroy all of Lord Voldemort's Horcruxes and fought in the Battle of Hogwarts in 1998, during which he lost his brother Fred, a loss which devastated him and his family, especially George, Fred's twin. [28] After two years as an Auror, he went to work at Weasleys' Wizard Wheezes with his brother George. Ron was also named the godfather of James Sirius Potter, his sister Ginny Weasley's and Harry Potter's eldest child. Ronald Bilius Weasley was born 1 March, 1980, to Arthur and Molly Weasley (née Prewett),[11] at the height of the First Wizarding War."
 },
 "cursed vaults": {
  "link": "https://harrypotter.fandom.com/wiki/Cursed_Vaults",
  "summary": "The Cursed Vaults were five legendary hidden rooms at Hogwarts School of Witchcraft and Wizardry, each vault shielded by a different curse placed on it. Some alleged that the vaults housed priceless treasures such as gold, prophecies, and other powerful magical artefacts dating back to before the school was founded while others believed they contained Dark Magic. Albus Dumbledore's research into the vaults revealed that a terrible amount of work had gone into their construction and that one could only guess that whatever they were built to hold, it followed that it was even more incredibly dangerous and complex than the magic used to make the vaults themselves, not to mention that whatever they contained would be likely to be far more terrible. Among the many theories circulating, Albus Dumbledore mentions two, that they were created by the Hogwarts founders themselves or that they were created by a Headmaster who suffered from paranoia, but he might have been trying to discourage Jacob's sibling from continuing their research into the vaults. The Gryffindor House ghost, Sir Nicholas de Mimsy-Porpington, later explained to the same student that because Hogwarts Castle was always intended as a safe place, the school shouldered the responsibility of safeguarding and protecting that which was dangerous from falling into the wrong hands, and carrying the burden of the job remarkably well despite the fact that subsequent heads of the school and members of the faculty came to recognise how it, to some extent, compromised the security of the castle. [1]\nSir Nicholas believed that while there was a general consensus among those who believed that the Cursed Vaults were real that they were most likely originally made to protect something dangerous by people wanting to take advantage of the school's ever-changing floorplan to make their locations more difficult to find, it was also possible that the vaults were created around something dangerous that could not be moved. [1]\nOver the centuries, numerous individuals had been overheard discussing the Vaults by Sir Nicholas throughout his time as a spectral resident at the castle. Among them were the Professors Fortinbras and Bartholomew, who were involved in the creation of a 'circle of trust' consisting of a group of teachers and students who all worked together researching the vaults with the intent of putting an end to the threat they posed to the school. [1]\nDuring her school career, Patricia Rakepick did research into the existence and reportedly tried to warn her teachers of the existence of the Cursed Vaults, to no avail. [2]\nAt some point during his magical education, a student named Jacob went looking for those vaults, endangering the whole school in the process, for which he was expelled."
 },
 "patricia rakepick": {
  "link": "https://harrypotter.fandom.com/wiki/Patricia_Rakepick",
  "summary": "[10]\nIn actuality, Rakepick also worked with the malevolent organisation known as R, during which she attempted to enter the Buried Vault, the last major obstacle before the final Cursed Vault, but did not succeed. [9] She was invited back to the school during the 1987–1988 school year by Professor Dumbledore, the school's Headmaster, to help put an end to the threat posed by the Vaults. [11] At the end of the year, she accepted his offer to assume the position of Defence Against the Dark Arts instructor, where she offered more freedom and protection to Jacob's sibling during their search for the remaining Vaults. While Professor Albus Dumbledore found her to be an exceptional pupil,[11] she was nevertheless greatly disliked by most of her professors for her rebellious streak, a sentiment that did not improve when she, rather than being a good role model to her younger peers as she grew older, began mentoring them in the art of trouble-making. [3] Some of her teachers included Filius Flitwick and Rolanda Hooch: the former was determined to keep an open mind about Rakepick, whereas the latter had a very low opinion of her. [3]\nIn her third year, she chose at least two electives: Care of Magical Creatures[12] and Arithmancy. [13] At some point in her student years, she asked the Care of Magical Creatures Professor, Silvanus Kettleburn, how to enter the Forbidden Forest without being seen, telling him she meant to explore the forest and study the creatures that dwelled within it, and expressing a desire to become a Magizoologist upon leaving school."
 },
 "lego harry potter building the magical world": {
  "link": "http://harrypotter.fandom.com/wiki/LEGO_Harry_Potter:_Building_the_Magical_World",
  "summary": "The book features two sections - \"The World of LEGO Harry Potter,\" featuring the various Wizarding world locations depicted within the series, and \"Beyond the Brick,\" with a behind-the-scenes look at creation, details on merchandising, and more. Explore the magic of Harry Potter™ and the fun of LEGO® building sets, now in 1 incredible book! This great guide gives readers an up-close look at the bricks, constructions, and minifigures of the LEGO® Harry Potter universe – from Hogwarts Castle to Hagrid’s hut. Features a time line that shows the evolution of the LEGO® Harry Potter construction sets, video game, and board game."
 },
 "michael gambon": {
  "link": "https://harrypotter.fandom.com/wiki/Michael_Gambon",
  "summary": "His father, Edward Gambon, was an engineer and his mother, Mary Hoare was a seamstress. His father decided to seek work in the rebuilding of London, and so the family moved to Mornington Crescent in north London, when Gambon was five. His father had him made a British citizen — a decision that would later allow Michael to receive an actual, rather than honorary, knighthood and CBE. [3] (although, under the British Nationality Act 1981 anyone born in Ireland before 1949 can still register as a British subject and, after five years' UK residence, as a British citizen). Raised a strict Catholic, he attended St Aloysius Boys' School in Somers Town and served at the altar. He then moved to St Aloysius' College in Hornsey Lane, Highgate, London, whose former pupils included Peter Sellers. He kept the job for a further year – acquiring a fascination and passion for collecting antique guns, clocks and watches, as well as classic cars. Five years later he wrote a letter to Michael MacLiammoir, the Irish theatre impresario who ran Dublin's Gate Theatre. Gambon made his professional stage début in the Gaiety Theatre, Dublin's 1962 production of Othello, playing \"Second Gentleman\", followed by a European tour."
 },
 "hermione granger": {
  "link": "http://harrypotter.fandom.com/wiki/Hermione_Granger",
  "summary": "Hermione first met Harry Potter and Ron Weasley aboard the Hogwarts Express, who found her unfriendly and somewhat of an \"insufferable know-it-all\",  an impression reinforced by her constant correct answers and eagerness to please the professors. However, she stepped in to take the blame from the boys after they had saved her from a troll on Hallowe'en in 1991, surprising them in a grateful way, which led to them quickly becoming friends. In her second year, Hermione had a key role in the discovery of the Chamber of Secrets, before falling victim to the basilisk unleashed upon Hogwarts following the opening of the Chamber. The next year, Hermione was granted permission to use a Time-Turner from the Ministry of Magic to facilitate her volition to study far more subjects than were possible without time travel, though she and Harry later used it to rescue Sirius Black from the Dementor's Kiss and Buckbeak the hippogriff from execution. During her fourth year, Hermione became an advocate for the better treatment of house-elves, forming the association S.P.E.W., and helped in Harry's preparation for the Triwizard Tournament. In her fifth year, Hermione was the driving force behind the creation of Dumbledore's Army and fought alongside fellow D.A. In her sixth year, Hermione continued her role as Prefect and fought in the Battle of the Astronomy Tower."
 },
 "harry potter film wizardry": {
  "link": "http://harrypotter.fandom.com/wiki/Harry_Potter_Film_Wizardry",
  "summary": "The book has information from the different directors' perspectives of the film to the actors in the films such as:\nWith each film, there is a production diary and a design team that spills secrets of what their thought process was for that film and what they felt was their feelings while shooting that specific film. There is also exclusive details about what the design, production and directing teams worked on how and why they decided to split Harry Potter and the Deathly Hallows into two films and specific scenes such as the Wedding of Bill Weasley and Fleur Delacour, the 1998 Break-in of Gringotts Wizarding Bank, the Ministry of Magic, and the Room of Requirement. Also included are specific scenes and how the production team put the magic together, examples being the three tasks of the Triwizard Tournament, the Little Hangleton graveyard, and even how they put together the challenges of Rubeus Hagrid the Part-giant, and the Black family tree tapestry, the Boggart, Hogsmeade, and much more. This Book includes some props, which can be removed such as:\nThere are slight differences between the UK and the USA versions. The UK version has a blue background and it depicts Harry Potter, Hermione Granger, Ron Weasley, Albus Dumbledore, Severus Snape, and Lord Voldemort. While Harry is standing in the middle of the cover (from to the top to bottom); the others have their own circle with just their faces, entwined by a background pattern. The only difference, other than the colour, it that instead of taking up the entire cover Harry has his own circle at the top that is entwined in the same background pattern."
 },
 "harry potter and the deathly hallows part 1": {
  "link": "https://harrypotter.fandom.com/wiki/Harry_Potter_and_the_Deathly_Hallows:_Part_1",
  "summary": "[3] Production of the two films occurred concurrently,[4] and treated as if it were one film. [5] The idea to split the films had been around since the middle of 2007,[2] but only really came into serious consideration after producer David Heyman was able to talk to writer Steve Kloves when the 2007–2008 Writers Guild of America strike ended and Heyman had Rowling's approval. [5]\nOn March 12, 2008, Warner Bros. additionally confirmed that the film would be split into two, to do justice to the book. [6] David Yates, director of Order of the Phoenix and Half-Blood Prince returned to direct and Steve Kloves wrote the screenplay. \"[4] Heyman described the workings behind the split: \"Deathly Hallows is so rich, the story so dense and there is so much that is resolved that, after discussing it with Rowling, we came to the conclusion that two parts were needed. [7]\nBefore David Yates was officially chosen to direct the film, others had expressed an interest in the job. [8] Guillermo del Toro, who passed on Prisoner of Azkaban, had expressed interest in directing Deathly Hallows,[9] but an increased workload ruled him out of the project. [11] Daniel Radcliffe said: \"This is a road movie, particularly in Part One of the film."
 },
 "harry potter and the philosophers stone film": {
  "link": "http://harrypotter.fandom.com/wiki/Harry_Potter_and_the_Philosopher%27s_Stone_(film)",
  "summary": "Harry Potter and the Philosopher's Stone is a British-American fantasy film based on the first novel by J. K. Rowling, released on 16 November, 2001. The film stars Daniel Radcliffe, Rupert Grint, Emma Watson, John Cleese, Robbie Coltrane, Richard Griffiths, Richard Harris, Ian Hart, John Hurt, Alan Rickman, Fiona Shaw, Maggie Smith, Sean Biggerstaff, Warwick Davis, Julie Walters, Zoë Wanamaker, David Bradley, and Tom Felton. On the night of 1 November, 1981, celebrated wizard Albus Dumbledore (Richard Harris) and his deputy Minerva McGonagall (Maggie Smith) meet up on Privet Drive in the Surrey town Little Whinging and discuss of the deaths of James and Lily Potter (Adrian Rawlins and Geraldine Somerville), whose one-year-old son Harry Potter (Saunders Triplets) is to be brought to them by their half-giant associate Rubeus Hagrid (Robbie Coltrane). As the three walk to the front lawn of Privet Drive house #4, McGonagall initially objects to Dumbledore leaving Harry with the Muggle (non-Magical) family that lives there known as the Dursleys, as she sees them as the \"worst sort of Muggles\" after spying on them day by day in her Animagus form (a silver tabby cat). Ten years pass and Harry (Daniel Radcliffe) lives as a household servant to the Dursleys, who treat him with hostility and tries to be a seemingly ordinary boy. His spoiled cousin, Dudley Dursley (Harry Melling) constantly bullies him."
 },
 "constance pickering": {
  "link": "https://harrypotter.fandom.com/wiki/Constance_Pickering",
  "summary": "Constance Pickering was a witch who worked for the British Ministry of Magic, and was the leader of the Statute of Secrecy Task Force. Silvia left out a plate and and the next day her garden was destroyed, leaving Constance feeling guilty. [8]\nShe once had a Crup named Ross, but her family had to give him away when Constance's brother turned out to be a squib, and Ross just wouldn't stop nipping his bum, which scarred him for life. [8]\nWhen Constance was a girl, her family took her to a Dragon sanctuary in Norway. They got to see the baby dragons up close and one of them bit Constance's finger, which hurt for a month. [8]\nConstance always thought Christmas crackers looked like loads of fun when her mother and sister pulled them together. Therefore Constance loved looking in their neighbours' windows and seeing their trees, all bright and shiny. [6]\nWhen Constance was ten years old, her grandmother came over for Christmas."
 },
 "books realworld": {
  "link": "https://harrypotter.fandom.com/wiki/Category:Books_(real-world)",
  "summary": "Written by British author J. K. Rowling, these books chronicle the lives of those in the Harry Potter universe."
 },
 "films realworld": {
  "link": "https://harrypotter.fandom.com/wiki/Category:Films_(real-world)",
  "summary": ""
 },
 "harry potter and the prisoner of azkaban film": {
  "link": "https://harrypotter.fandom.com/wiki/Harry_Potter_and_the_Prisoner_of_Azkaban_(film)",
  "summary": "Harry Potter and the Prisoner of Azkaban is a British-American fantasy film based on the third novel by J. K. Rowling, released on 31 May 2004 in the UK, and 4 June, 2004 in North America. Chris Columbus (the director of the first two films) also joined the production team, as did Mark Radcliffe. Reprising their roles from the previous films are Daniel Radcliffe, Rupert Grint, Emma Watson, Robbie Coltrane, Richard Griffiths, Alan Rickman, Fiona Shaw, Maggie Smith, Julie Walters, David Bradley, Tom Felton, Robert Hardy and Mark Williams, while Julie Christie, Gary Oldman, Timothy Spall, David Thewlis, Emma Thompson, Pam Ferris, and Dawn French make their debut for the series. In 1993, shortly after the end of his second year at Hogwarts School of Witchcraft and Wizardry during the second film, Harry Potter (Daniel Radcliffe) spends another dissatisfying summer at the Dursleys' house studying magic at night without being caught, while family vacations to Egypt and France respectively are being spent by his friends Ron Weasley (Rupert Grint) and Hermione Granger (Emma Watson), both of whom he is determined to join in visits to village of Hogsmeade if he has either his Aunt Petunia (Fiona Shaw) or Uncle Vernon (Richard Griffiths) sign his Hogsmeade permission form. On his thirteenth birthday (July 31), he gets the opportunity to do so, as long as he hides his abilities while Vernon's sister Marge arrives for a visit. However, at dinnertime, Marge viciously insults Harry and his parents, calling James Potter \"useless\" and Lily Potter \"a bitch\", which in turn triggers Harry's anger and his unconscious magical powers cause her to inflate and float away. There, Minister for Magic Cornelius Fudge (Robert Hardy) tells Harry he will not be expelled."
 },
 "creator harry potter and the chamber of secrets": {
  "link": "https://harrypotter.fandom.com/wiki/Creator:_Harry_Potter_and_the_Chamber_of_Secrets",
  "summary": "In this game, you can explore different parts of the Harry Potter world, customise them with Lego models, and play as many different characters. Upon completing a challenge, you unlock more models, worlds, and characters. There are many more worlds in this game than the previous one, some of which include Knockturn Alley, Gringotts Bank, and The Chamber of Secrets itself."
 },
 "harry potter and the goblet of fire film": {
  "link": "https://harrypotter.fandom.com/wiki/Harry_Potter_and_the_Goblet_of_Fire_(film)",
  "summary": "Harry Potter and the Goblet of Fire is a British-American fantasy film based on the fourth novel by J. K. Rowling, released on 18 November, 2005. Reprising their roles from the previous films are Daniel Radcliffe, Rupert Grint, Emma Watson, Robbie Coltrane, Michael Gambon, Jason Isaacs, Gary Oldman, Alan Rickman, Maggie Smith, Timothy Spall, David Bradley, Warwick Davis, Tom Felton, Robert Hardy, Shirley Henderson, and Mark Williams, while Brendan Gleeson, Miranda Richardson, Frances de la Tour, Predrag Bjelac, Roger Lloyd-Pack, Stanislav Ianevski, Clémence Poésy, Robert Pattinson, and David Tennant make their debut for the series. This film is also the first appearance for Ralph Fiennes as Lord Voldemort, a role which he would go on to reprise in all subsequent films in the series, except for Harry Potter and the Half-Blood Prince. Harry then travels by Portkey to the 422nd Quidditch World Cup with Amos and Cedric Diggory, whereby they witness the defeat of Bulgaria to Ireland. After the match, a gang of Death Eaters sparks terror among the campsite and Harry is separated from the others in the confusion and is knocked unconscious. After the destruction of the campsite, the unidentified young man from Harry's dream casts the Dark Mark into the sky, but flees when the others find Harry. Harry, Ron, and Hermione arrive at Hogwarts, where they learn that the Triwizard Tournament will be taking place at the school that year. Delegations of students from Beauxbatons and Durmstrang arrive in the school to take part in the tournament: however, during the introductions, Alastor \"Mad-Eye\" Moody enters the Great Hall and is introduced as the new Defence Against the Dark Arts teacher for that year. However, before the celebrations can begin, an unexpected fourth name is ejected from the goblet and is revealed to be Harry Potter, who professes his innocence to Albus Dumbledore as to how his name got there. His innocence is confirmed by Moody, but Harry is still required to compete in the tournament, as Barty Crouch Snr states that Harry is under a binding magical contract."
 },
 "lego harry potter characters of the magical world": {
  "link": "http://harrypotter.fandom.com/wiki/LEGO_Harry_Potter:_Characters_of_the_Magical_World",
  "summary": "The book is organised by sections for every title in the Harry Potter series. It includes numerous variations of key characters such as Harry Potter and Severus Snape. The book also includes a special look at elements unique to the LEGO Harry Potter releases and feature highlighting releases that have double-sided heads. This title is a followup to LEGO Harry Potter: Building the Magical World. Meet the magical minifigures of the LEGO® Harry Potter™ world in DK's latest addition to our new series, LEGO® Harry Potter™: The Characters of the Magical World! From the multiple variations of Harry and Ron to the unique characteristics of Snape and Voldemort, readers can learn about each minifigure and the magical sets they star in while learning fun and interesting LEGO Harry Potter facts! In-depth profiles alongside dynamic photography will help you to increase your LEGO Harry Potter knowledge and perhaps encourage young readers to conjure up a few spells of their own! TM & © Warner Bros. Entertainment Inc. Harry Potter Publishing Rights © JKR."
 },
 "daniel radcliffe": {
  "link": "http://harrypotter.fandom.com/wiki/Daniel_Radcliffe",
  "summary": "He made his acting debut at 10 years of age in BBC One's 1999 television film David Copperfield, followed by his cinematic debut in 2001's The Tailor of Panama. At age 11, he was cast as Harry Potter in the first Harry Potter film, and starred in the series for 10 years until the release of the eighth and final film in 2011. Radcliffe began to branch out to stage acting in 2007, starring in the London and New York productions of Equus, and in the 2011 Broadway revival of the musical How to Succeed in Business Without Really Trying. Radcliffe was born on 23 July 1989 in West London, England, the only child of Alan George Radcliffe, a literary agent, and Marcia Jeannine Gresham (née Marcia Gresham Jacobson), a casting agent who was involved in several films for the BBC, including The Inspector Lynley Mysteries and Walk Away And I Stumble. However, his parents decided to let him audition for the role of young David Copperfield to boost his confidence after he told them that he 'wasn't good at anything', as in December 1999, he made his first on-screen appearance as the young David Copperfield in David Copperfield, the BBC's televised version of the Charles Dickens' novel David Copperfield. He reprised the role of Harry in Harry Potter and the Goblet of Fire, scheduled for a November 2005 release. Radcliffe starred in the independent Australian film December Boys directed by Rod Hardy within the next year and in 2007 he once again put on the famous lightning-bolt shaped scar and round glasses in the fifth Harry Potter film Harry Potter and the Order of the Phoenix. He appeared in the final two Harry Potter movies, Harry Potter and the Deathly Hallows: Part 1 and Harry Potter and the Deathly Hallows: Part 2, in 2010 and 2011 respectively."
 },
 "harry potter and the chamber of secrets film": {
  "link": "https://harrypotter.fandom.com/wiki/Harry_Potter_and_the_Chamber_of_Secrets_(film)",
  "summary": "Reprising their roles from Philosopher's Stone are Daniel Radcliffe, Rupert Grint, Emma Watson, John Cleese, Robbie Coltrane, Warwick Davis, Richard Griffiths, Richard Harris, Alan Rickman, Fiona Shaw, Maggie Smith, Julie Walters, Bonnie Wright, David Bradley, Tom Felton, and Sean Biggerstaff, while Kenneth Branagh, Jason Isaacs, Robert Hardy, Shirley Henderson, Gemma Jones, Miriam Margolyes, Mark Williams and Toby Jones make their debut for the series. In 1992, shortly after the end of his first year at Hogwarts School of Witchcraft and Wizardry during the first film, Harry Potter (Daniel Radcliffe) spends a dreadful summer at the Dursleys' house without being allowed to use magic outside of school nor receiving any letters from his new friends, Ron Weasley (Rupert Grint) and Hermione Granger (Emma Watson), both of whom he is unable to contact because neither his Aunt Petunia (Fiona Shaw) nor Uncle Vernon (Richard Griffiths) would allow their nephew's pet owl Hedwig out of her padlocked cage. On the evening of his twelfth birthday (July 31), he is visited in his room and warned that he will be in mortal danger if he returns to Hogwarts by a house-elf named Dobby (Toby Jones), who reveals that he has intercepted all of the letters to make it seem as though Harry's friends had forgotten him, hoping that it will then dissuade Harry from returning. But Harry ignores the warning and is determined to seize the letters, so Dobby, seeing that he will have to use force, heads downstairs and destroys a large cake that Petunia has baked for an important dinner party which Vernon is holding downstairs for the family of his client Mr Mason (Jim Norton) by the use of a Hover Charm, dropping it on Mrs Mason's (Veronica Clifford) head. The next night, Ron and his older brothers Fred and George (James and Oliver Phelps), come to Harry's rescue in an enchanted Ford Anglia belonging to their father, Head of the Ministry of Magic's Misuse of Muggle Artefacts Office Arthur Weasley (Mark Williams). After a pleasant stay together in the Weasley home, the Burrow, Harry accompanies the family on a trip through the Floo Network to buy some first year school supplies for Ron's younger sister Ginny Weasley (Bonnie Wright) in Diagon Alley, where they encounter Hermione and Hogwarts half-giant gamekeeper Rubeus Hagrid (Robbie Coltrane) while attending a book signing at Flourish and Blotts for flamboyant celebrity author Gilderoy Lockhart (Kenneth Branagh), who is recently appointed to teach at Hogwarts as the school's new Defence Against the Dark Arts Professor. After the signing, the trio run into their school rival Draco Malfoy (Tom Felton) and his father, chief Hogwarts governor Lucius Malfoy (Jason Isaacs), who manages to slip a diary into Ginny's belongings while arguing with Mr Weasley about the latter's recent Muggle Protection Act for the Ministry. As a loophole, however, the two boys instead fly to Hogwarts in the Ford Anglia, which unfortunately runs out of fuel for its Invisibility Booster when it catches up to the train (allowing the \"flying car\" to be seen by numerous Muggles) and crashes into the Whomping Willow on the school grounds."
 },
 "harry potter and the philosophers stone": {
  "link": "http://harrypotter.fandom.com/wiki/Harry_Potter_and_the_Philosopher%27s_Stone",
  "summary": "Harry Potter and the Philosopher's Stone is the first novel in the Harry Potter series written by J. K. Rowling. The book was released in the United States under the name Harry Potter and the Sorcerer's Stone because the publishers were concerned that most American readers would not be familiar enough with the term \"Philosopher's Stone\". However, this decision led to criticism by the British public who felt it shouldn't be changed due to the fact it was an English book. \"For Jessica, who loves stories, for Anne, who loved them too, and for Di, who heard this one first\"\nThe book is dedicated to three female relatives of the author J. K. Rowling: Jessica, her eldest daughter, Anne, her late mother, and Di, her sister. All Harry knows is a miserable life with the Dursleys: his horrible aunt and uncle and their abominable son, Dudley. Harry's room is a tiny Cupboard Under the Stairs, he hasn't had a birthday party in ten years, and his birthday present is his uncle's old socks. There he finds not only friends, aerial sports, and magic around every corner, but a great destiny that's been waiting for him... if Harry can survive the encounter.\" Harry's room is a tiny closet beneath the stairs, and he hasn't had a birthday party in ten years."
 },
 "harry potter page to screen the complete filmmaking journey": {
  "link": "http://harrypotter.fandom.com/wiki/Harry_Potter_Page_to_Screen:_The_Complete_Filmmaking_Journey",
  "summary": "\"From the acquisition of the film rights to the casting of Harry, Ron, and Hermione and the assembly of the creative team, Harry Potter: Page to Screen is a unique, behind-the-scenes look at the making of one of the most popular film series in cinema history, as told by the people who made the magic real. From the moment the book was optioned to the last film, Harry Potter and the Deathly Hallows - Part 2, this book reveals all the filming secrets, never-before-seen images, and the most memorable moments - real and fictional - of the Harry Potter saga. Not only do Radcliffe and his fellow cast members discuss the reality of \"growing up Potter,\" they also reflect on the countless memories that made the Potter experience so unique: meeting J.K. Rowling; Richard Harris's (the original Dumbledore) death; the effects of 9-11 on the cast and crew; and the day to day experience of bringing a film to life. Fully supported by Warner Bros. Entertainment, Harry Potter: Page to Screen is created by the same team responsible for the hugely successful Harry Potter: Film Wizardry, and is sure to delight Muggles everywhere.\""
 },
 "the queens handbag": {
  "link": "https://harrypotter.fandom.com/wiki/The_Queen%27s_Handbag",
  "summary": "The skit starred Daniel Radcliffe, Emma Watson, Rupert Grint and Matthew Lewis in their familiar Harry Potter roles, and was filmed during production of Harry Potter and the Order of the Phoenix. Throughout Children's Party at the Palace, an ongoing storyline involved various characters trying to find the Queen's missing handbag. Harry Potter, Hermione Granger and Ron Weasley enter in the midst of Hermione complaining about an (unheard) joke not making sense. Although Ron thinks the letter comes from the Minister for Magic, Hermione realises it actually comes from the Muggle Prime Minister. Addressed to \"whomever it may concern - as long as they can use magic\", the letter reports on the Queen's handbag being stolen. The letter stresses the urgency of retrieving the handbag as it contains Her Majesty's reading glasses which she needs in order to read her speech at her 80th birthday celebration. Harry suggests Veritaserum could be used to make the thieves confess, but Hermione points out they do not know who the thief is yet. Unable to do it by himself, Ron joins him and together they perform the charm again -- only to have a pile of different lost handbags appear on the table. Neville Longbottom arrives and spots his grandmother's handbag among the litter (Ron asks him if his gran happens to be the Queen)."
 },
 "emma watson": {
  "link": "https://harrypotter.fandom.com/wiki/Emma_Watson",
  "summary": "[2] Prior to being cast in the Harry Potter film series, Watson had only acted in school plays. Along with plays, Emma participated in many other school productions, including the Daisy Pratt Poetry Competition, in which she won first place for her year at age seven. At the age of eleven, Watson made her professional acting debut in Harry Potter and the Philosopher's Stone playing the vulnerable know-it-all Hermione Granger. In 2004 and 2005, she again played the brainy Hermione Granger in Harry Potter and the Prisoner of Azkaban and Harry Potter and the Goblet of Fire. In 2007, she returned to the Potter franchise a fifth time in Harry Potter and the Order of the Phoenix, reprising her role as Hermione Granger. Following the release of Order of the Phoenix, Watson made her first major forays beyond the Potter franchise, playing Pauline Fossil in the television film Ballet Shoes, and voicing Princess Pea in the animated film The Tale of Despereaux. She was originally not going to return to the role of Hermione for Harry Potter and the Half-Blood Prince to finish her schooling, but soon after fulfilled her role. She then went on to perform the character for the final two Harry Potter films, filmed in 2008-2009 and released in 2010 and 2011. In 2008, Emma was nominated and awarded fourth place in Portrait Magazine's Top 30 Under 30 2008 list making this her 2nd time."
 },
 "jacobs sibling": {
  "link": "http://harrypotter.fandom.com/wiki/Jacob%27s_sibling",
  "summary": "Their brother Jacob's expulsion from Hogwarts for endangering fellow students in his quest to find the Cursed Vaults had an impact on his younger sibling's first year at Hogwarts when many other students whispered about them for their elder sibling's breaking of school rules which had disgraced their shared schoolhouse. The incident was well-covered in the Daily Prophet, as was Jacob's running away from home, which had a profound effect on the younger sibling. Throughout their seven years at Hogwarts, they successfully broke into every one of the five Cursed Vaults, showing immense bravery, intelligence, dedication and resourcefulness. They maintained friendships with lots of schoolmates and went through exciting adventures together, rescuing Jacob from the Buried Vault[18] and breaking the ancient statue curse in the Sunken Vault. They had one[20] older sibling, Jacob. They apparently lived in close proximity to Muggle dwellings,[21] but they showed little knowledge of Muggle life as an adolescent and must have had limited interaction with their neighbours. [22]\nWhen they were five or six years old, they and Jacob pretended to duel with Liquorice Wands. At one point, Jacob convinced his sibling to steal Sickles from their mother's coat pockets. During their childhood, their parents worked together to teach Jacob and his sibling that they could not go around flaunting their magic. They performed wandless magic when they were young, shattering one of their mother's tea sets when they sneezed."
 },
 "harry potter and the halfblood prince": {
  "link": "https://harrypotter.fandom.com/wiki/Harry_Potter_and_the_Half-Blood_Prince",
  "summary": "Set during Harry Potter's sixth year at Hogwarts, Lord Voldemort is definitely back, and with a vengeance. Harry finds his world is yet again changing: wizards and witches and Muggles alike are dying, despite the efforts of the Ministry of Magic and the Order of the Phoenix. Despite the danger, Harry and his best friends, Ron and Hermione, return to the familiar life of Hogwarts for their sixth year. classes in preparation for life after Hogwarts, and Harry gets some much needed Potions help from the mysterious Half-Blood Prince. Harry deeply questions his own feelings for Ginny Weasley, who is Ron's younger sister, while trying to understand the effect it is having on his friends. Yet, while life at Hogwarts continues, the deaths also continue, with several near-fatal incidents occurring at Hogwarts. Danger seems to lurk around every corner, and Harry is as determined as ever to unmask it. Albus Dumbledore takes Harry under his guidance and together they explore Lord Voldemort's past, to find a way to stop him before it is too late. Ultimately, Harry realises he must accepts his role as The Chosen One, and his destiny to either kill or be killed by Voldemort, as neither can live while the other survives."
 },
 "harry potter and the order of the phoenix": {
  "link": "https://harrypotter.fandom.com/wiki/Harry_Potter_and_the_Order_of_the_Phoenix",
  "summary": "It was one of the most widely-anticipated books of the series, since there was a wait of three years between it and the previous book, Goblet of Fire. At 38 chapters, it is also the longest book in the series, having jokingly been labelled as heavier than a refrigerator (by Stephen Fry at the Royal Albert Hall event) and used as a benchmark for the size of the next two books. \"To Neil, Jessica and David, who make my world magical\"[1]\nDr Neil Murray is Jo's husband, Jessica is her daughter, and David is her son. Harry has a lot on his mind for this, his fifth year at Hogwarts: a Defence Against the Dark Arts teacher with a personality like poisoned honey; a big surprise on the Gryffindor Quidditch team; and the looming terror of the Ordinary Wizarding Level exams. But all these things pale next to the growing threat of He-Who-Must-Not-Be-Named, one that neither the magical government nor the authorities at Hogwarts can stop. As the grasp of darkness tightens, Harry must discover the true depth and strength of his friends, the importance of boundless loyalty, and the shocking price of unbearable sacrifice. In his fifth year at Hogwarts, Harry faces challenges at every turn, from the dark threat of He-Who-Must-Not-Be-Named and the unreliability of the government of the magical world to the rise of Ron Weasley as the Keeper of the Gryffindor Quidditch Team."
 },
 "harry potter and the prisoner of azkaban video game": {
  "link": "https://harrypotter.fandom.com/wiki/Harry_Potter_and_the_Prisoner_of_Azkaban_(video_game)",
  "summary": "It is the third game release in the Harry Potter series and was based on J. K. Rowling's novel, Harry Potter and the Prisoner of Azkaban. Three different versions of this game were released for different gaming platforms:\nHarry Potter learns that a dangerous man, Sirius Black, has escaped from Azkaban and is allegedly after him. With his best friends Ron Weasley and Hermione Granger, Harry learns and masters the spells and skills needed to confront Black. However, the reality of the crime that Black was accused of, the murder of thirteen people twelve years prior, becomes clear as the real murderer, Peter Pettigrew, is discovered to be in hiding at Hogwarts, disguised as Ron's pet rat, Scabbers. Together with Professor Remus Lupin and Black, Harry, Ron, and Hermione unmask Pettigrew, only to have him escape. Using Hermione's Time-Turner, Harry and Hermione go back in time and rescue the Hippogriff Buckbeak and use him to rescue Sirius Black and from the terrible fate of a Dementor's Kiss. As in the first fight, A Dementor grabs Harry and raises his face to the Dementor's hood, but as it was attempting to perform a kiss, the future version of Harry conjures a Patronus and starts a second fight. Also, on the PS2 version, the player can use an Eyetoy toy camera that allows the player to play mini games by moving the character's arms and body."
 },
 "firemaking spell": {
  "link": "https://harrypotter.fandom.com/wiki/Fire-Making_Spell",
  "summary": "The Fire-Making Spell,[2] also known as the Fire-Making Charm[3] (Incendio)[3][1][2] was a charm that conjured a jet of flames that could be used to set things alight. [2]\nThis spell was listed in The Standard Book of Spells, Grade 1 by Miranda Goshawk. [1] This spell was also taught to students during their first year at Hogwarts School of Witchcraft and Wizardry in Charms (and revised during the second year),[3][4] Herbology class to deal with the Devil's Snare and other dangerous plants,[3] and was reviewed in the fifth year for students sitting their O.W.L. [5]\nThis spell was mentioned in the lyrics of Celestina Warbeck's song \"A Cauldron Full of Hot, Strong Love\"."
 },
 "untitled charity auction story": {
  "link": "http://harrypotter.fandom.com/wiki/Harry_Potter_Prequel",
  "summary": "[1] The story is set many years before the Harry Potter novels, during the first First Wizarding War, and recounts an adventure had by Sirius Black and James Potter. [1] To date, it has only been officially published in a limited-release, UK-exclusive book. On 29 May 2008, J. K. Rowling announced on her official site\nthat she and 12 other authors had been invited to contribute hand-written cards to \"What's Your Story? [3][4] The proceeds from the auction of these \"storycards\" would benefit English PEN and Dyslexia Action. [4] Rowling stated that she had written a \"short [...] excerpt from a prequel to the Potter series\" on her card. [3] However, although she stated she wrote the story with \"frightening ease,\" she noted that she was not working on a full-length prequel. [3]\nThe cards from the 13 participating authors were auctioned on 10 June 2008, raising a total of £47,150. [5][1] Rowling's card sold for £25,000."
 },
 "foundable": {
  "link": "http://harrypotter.fandom.com/wiki/Foundable",
  "summary": "Foundables were stuck in place by a piece of chaotic magic, called a Confoundable, thus threatening to expose the wizarding world and in potential serious breach of the International Statute of Wizarding Secrecy. [1]\nThe Statute of Secrecy Task Force, created as a response to the Calamity, was tasked to investigate and contain this threat and prevent outbreaks of magic from being noticed by Muggles by retrieving all Foundables on the Registry: a listing of all the missing Foundables known to the Ministry."
 },
 "magic beyond words the jk rowling story": {
  "link": "https://harrypotter.fandom.com/wiki/Magic_Beyond_Words:_The_J.K._Rowling_Story",
  "summary": "Magic Beyond Words: The J.K. Rowling Story is a television film by the Lifetime television channel, broadcast on 18 July, 2011. Canada locations altered to look like British locations, details the journey of struggling single mother J. K. Rowling, her bid to become a published author, and her rise to fame that followed the publication of Harry Potter and the Philosopher's Stone. The film was criticised for being too lacklustre (mainly because of the author having no say in the production), but it also shed some light on her personal life, and featured scenes such as her highly abusive first husband and the death of her mother. J. K. Rowling herself has never seen the film, commenting that the concept of watching it \"makes [her] curl up like a pretzel\"."
 },
 "alan rickman": {
  "link": "http://harrypotter.fandom.com/wiki/Alan_Rickman",
  "summary": "[12]\nAlan Rickman was born on 21 February 1946 on a council estate in South Hammersmith, London to a working class family, the son of Margaret Doreen Rose (née Bartlett; b. 16 Feb. 1997 in Leicester, Leicestershire),[13][14] a housewife, and Bernard William Rickman (b. April 1914 in Fulham, Middlesex—d. 9 Sep. 1954),[15][16] a factory worker, painter and decorator. [17][18] At the time of his older brother, David's birth, he had been working as a WWII aircraft fitter. [19] His ancestry was English, Irish and Welsh; his father was Catholic and his mother was a Methodist. [5]\nBefore his mother married his birth father, she was married to Reginald Cory in 1931 in Hammersmith[20] before unofficially separating from him and marrying Bernard Rickman in 1940. [21]\nHe had one elder brother, David Bernard John (b. Sep. 1944),[19] a graphic designer who married Christine J. Morrissey in 1970[2] and live together in Watford, Hertfordshire;[22] a younger brother, Michael Keith (b. 21 Nov. 1947), a professional tennis coach as well as a Councillor on Harborough District Council of the conservative party and lives in Medbourne, Leicestershire;[19][23][24] and a younger sister, Sheila J. Innes (b. [5][25][26][3] Like Alan, she won a scholarship to Godolphin and Latymer School, she attended Kingsway Princeton College, London, currently works as an office manager for a company named PRN and lived in Bordon, Hampshire with her husband and daughters until 2009. [22][3][27]\nWhen Rickman was eight, his father died of lung cancer on 9 September 1954 at age forty,[5][28][16] leaving his mother to raise him and his three siblings mostly alone."
 },
 "ginevra weasley": {
  "link": "https://harrypotter.fandom.com/wiki/File:Ginny_shy.gif",
  "summary": "11 August, 1981),[1] occasionally known as Gin by Harry Potter,[4] was an English pure-blood[3] witch, the youngest of Arthur and Molly Weasley's (née Prewett) seven children, and the first female to be born into the Weasley line for several generations. Ginny attended Hogwarts School of Witchcraft and Wizardry from 1992-1999, a year beneath the famous Harry Potter, and was sorted into Gryffindor House. During her first year, she developed a long-standing crush on Harry Potter and came under the influence of the memory of Tom Riddle's sixteen-year-old self. Following that ordeal, Ginny grew into a confident young woman, becoming an important member of Dumbledore's Army, an organisation taught and led by Harry Potter in her fourth year. She would later fight in the Battle of the Department of Mysteries (1996), the Battle of the Astronomy Tower (1997), and the Battle of Hogwarts (1998). Ginny eventually married Harry Potter and the couple had three children; James Sirius (named after Harry's father and godfather), Albus Severus (named after Albus Dumbledore and Severus Snape), and Lily Luna Potter (named after Harry's mother and their friend Luna Lovegood). Ginevra Molly Weasley was born on 11 August, 1981, to Arthur and Molly Weasley (née Prewett), the first girl born into the Weasley family in a long time, and the last for that generation after her six older brothers: Bill, Charlie, Percy, Fred, George and Ron. At that time, the wizarding community she grew up in at the height of the First Wizarding War, during which her maternal uncles, Gideon and Fabian Prewett, were murdered while fighting a group of four Death Eaters led by Antonin Dolohov."
 },
 "mike newell": {
  "link": "https://harrypotter.fandom.com/wiki/Mike_Newell",
  "summary": "Newell directed various British Television shows from the 1960s onwards (Such as Spindoe (1968), credited as Cormac Newell, and Big Breadwinner Hog). However, he eventually graduated into film direction and then he went on to make the horror film The Awakening (1980) and Bad Blood (1981) about a New Zealand mass murderer. His first film was The Man in the Iron Mask (1977), made for TV. His first critically acclaimed movie was Dance with a Stranger (1985), a biographical drama starring Miranda Richardson as Ruth Ellis, the last woman to be hanged in Great Britain. Newell continued his successes in the film industry with Enchanted April (1992), an adaptation of the 1922 novel The Enchanted April; Miranda Richardson received a Golden Globe for Best Actress in a Comedy/Musical and Joan Plowright won a Golden Globe for Best Supporting Actress in a Comedy/Musical. The comedy Four Weddings and a Funeral (1994) was also critically acclaimed – it won numerous awards, including a César Award (Best Foreign Film), a Golden Globe, Best Actor - Hugh Grant, and a few London Critics Circle Film Awards (Best Director, Film, Producer, and Screenwriter). Since these award-winning productions, Newell has directed a number of films in Hollywood, such as Donnie Brasco (1997) (starring Al Pacino and Johnny Depp), Pushing Tin (1999) (starring John Cusack, Billy Bob Thornton, Cate Blanchett, and Angelina Jolie), and Mona Lisa Smile (2003) (starring Julia Roberts, Kirsten Dunst, and Julia Stiles)."
 },
 "sandbox": {
  "link": "https://harrypotter.fandom.com/wiki/Harry_Potter_Wiki:Sandbox",
  "summary": ""
 },
 "rupert grint": {
  "link": "https://harrypotter.fandom.com/wiki/Rupert_Grint",
  "summary": "Before being cast in Harry Potter he had only appeared in school plays and with his local theatre group Top Hat Stage School in such productions as Peter Pan and Rumplestiltskin. A self-proclaimed fan of the Harry Potter book series, young Rupert was adamant about getting a role in the first film. He entered a video he made of himself rapping about the role of Harry Potter, and at the age of 11, won the role of Harry's best friend Ron Weasley. After completing the first Harry Potter film, Harry Potter and the Philosopher's Stone, he appeared as Alan A. Allen in the British comedy film Thunderpants (2002). In 2002 and 2004, he again starred as Ron Weasley in the Harry Potter sequels, Harry Potter and the Chamber of Secrets and Harry Potter and the Prisoner of Azkaban. In 2005, he again played Ron Weasley in Harry Potter and the Goblet of Fire. Marking his first foray from the comic-goofball-sidekick roles, Rupert starred in the coming of age story Driving Lessons with Laura Linney and Julie Walters (Molly Weasley) which was released in 2006."
 },
 "editing": {
  "link": "https://harrypotter.fandom.com/wiki/Help:Editing",
  "summary": "Additionally, the alternative editors can still be found under the Edit button dropdown - for example, you can still access the 2017 source editor from the dropdown even if the VisualEditor is the default. Show changes, Preview and Save can be found at the bottom of the editor window. When you are on the edit page, on top of the edit window, you can see which editor you are using. If visual editor is set as your preference, switching to source editor will take you to the 2017 VisualEditor source mode."
 },
 "talbott winger": {
  "link": "http://harrypotter.fandom.com/wiki/Talbott_Winger",
  "summary": "[8] His mother taught him how to become an Animagus, taking the form of an eagle. [9]\nIn response, the Dark Lord's Death Eaters attacked their home, a conflict during which both of his parents were murdered while Talbott himself successfully escaped with his life thanks to his Animagus ability. He also helped Care of Magical Creatures Professor Silvanus Kettleburn tame a Hippogriff once, a feat also achieved by Jacob's sibling in their fourth year. [5]\nIn or prior to the 1986–1987 school year, he admitted the truth to Minerva McGonagall. While she understood his initial reasons for keeping it secret perfectly (namely the fear that if he registered, the Death Eaters might learn of it and come after him), she nevertheless sternly instructed him to abide by the law that all Animagi had to register with the British Ministry of Magic, to which he half-heartedly agreed. [9]\nDuring his third year, Talbott took Divination as an elective. [10]\nHe helped Jacob's sibling become an Animagus at the beginning of this year. [5][11] During Jacob's sibling's and Talbott's talk with McGonagall, she proclaimed that if he did not agree, she \"will take it as a personal offence and drag him to the Ministry myself\". Around the anniversary of his parents' murder, he lost his necklace, whose feather had been extracted from his mother's Animagus form, a White Swan."
 },
 "myra curio": {
  "link": "http://harrypotter.fandom.com/wiki/Myra_Curio",
  "summary": "[1] During her formative years, she received her magical education, presumably by attending Hogwarts School of Witchcraft and Wizardry, like most magical children in their wizarding community. [5]\nSometime after her seventeenth birthday, Myra joined the Ministry of Magic in London, and eventually began working for the Muggle Liaison Office in the Department of Magical Accidents and Catastrophes. A respected authority on the subject of Muggle Relations and the Muggle world in general, Myra was known to have been called upon to lend her expertise to other Ministry authorities, such as the Department for the Regulation and Control of Magical Creatures, where she alongside Sage Bragnam, Gethsemane Prickle and Omar Abasi during investigations relating to creature-related incidents. [6]\nPresumably inspired to pursue a career that was more \"hands-on\" after having assisted of Mathilda Grimblehawk and her partner with their field work, she eventually transferred to the Department of Magical Law Enforcement and became a Magical Law Enforcement Officer, working for the Misuse of Muggle Artefacts Office. [7]\nAn avid Muggle enthusiast who thoroughly enjoyed her job and the opportunity to work with other people, Myra was a friendly, well-meaning individual who were always happy to help out her colleagues, being friendly with people like Mathilda Grimblehawk, and her partner."
 },
 "chiara lobosca": {
  "link": "http://harrypotter.fandom.com/wiki/Chiara_Lobosca",
  "summary": "When Chiara was seven, werewolf Fenrir Greyback bit her, causing her to become a werewolf as well. [5]\nAt one point, Chiara befriended her neighbour Selina. When Chiara told Selina that she was a werewolf, Selina was not afraid at first. However, after Selina witnessed one of Chiara's transformations, she was terrified, and did not come near Chiara anymore due to her fear. Eventually, Chiara asked her mother to Obliviate Selina so Selina would no longer live in fear. [5]\nIn 1984, Chiara began attending Hogwarts School of Witchcraft and Wizardry and was sorted into Hufflepuff where she may have shared a dorm with Penny Haywood and Nymphadora Tonks. [1] Headmaster Albus Dumbledore was aware of her condition and arranged for Professor Snape to brew the newly discovered wolfsbane potion to control her transformations, though he was only able to brew one dose at a time due to an Aconite shortage. Chiara was very interested in healing magic, and hoped to one day become a healer at St Mungo's Hospital for Magical Maladies and Injuries. At some point during her time at Hogwarts, as she was leaving the Forbidden Forest, Borf, a cub from the Forbidden Forest wolf pack, followed her."
 },
 "harry potter wiki forums": {
  "link": "http://harrypotter.fandom.com/wiki/Forum:Harry_Potter_Wiki_Forums",
  "summary": "For discussions relating to the wiki and its content, please visit the Wizengamot."
 },
 "harry potter and me": {
  "link": "http://harrypotter.fandom.com/wiki/Harry_Potter_and_Me",
  "summary": "Notes shown in the documentary details students in Harry Potter's year, including Wayne Hopkins, Kevin Entwhistle and Tracey Davis. In the series we are introduced to 8 Gryffindor students (Harry Potter, Ronald Weasley, Neville Longbottom, Dean Thomas, Seamus Finnigan, Hermione Granger, Lavender Brown and Parvati Patil), 4 Hufflepuff students (Ernie Macmillan, Justin Finch-Fletchley, Hannah Abbott, and Susan Bones), 6 Ravenclaw students (Terry Boot, Mandy Brocklehurst, Michael Corner, Anthony Goldstein, Padma Patil, and Lisa Turpin) and 8 Slytherin students (Draco Malfoy, Vincent Crabbe, Gregory Goyle, Blaise Zabini, Theodore Nott, Pansy Parkinson, Millicent Bulstrode and Daphne Greengrass) of Harry's year. The addition of the class list gives us 4 further Hufflepuffs (Wayne Hopkins, Megan Jones, Roger Malone and Kevin Entwhistle), 4 Ravenclaws (Isobel MacDougal, Stephen Cornfoot, Oliver Rivers, and Sue Li), and 1 Slytherin (Tracey Davis)."
 },
 "exploding charm": {
  "link": "http://harrypotter.fandom.com/wiki/Exploding_Charm",
  "summary": "[3]\nDuring the 1987–1988 school year at Hogwarts School of Witchcraft and Wizardry, this spell was taught to fourth years in Charms class by Professor Filius Flitwick, at Hogwarts School of Witchcraft and Wizardry. [2]\nAt the start of the 1990–1991 school year at Hogwarts, Corey Hayden used this charm in the Hogwarts Library in front of Jacob's sibling, allowing them to get detention. [4]\nScorpius Malfoy noted that the explosions produced by this charm were rather noisy, and thus inconvenient for when trying to destroy something stealthily, such as a Time-Turner. [5]\nDuring the Calamity in the 2010s, volunteer wizards and witches of the Statute of Secrecy Task Force heavily used the Exploding Charm in their mission to overpower Confoundables, in order to free Foundables."
 },
 "harry potter quidditch world cup": {
  "link": "https://harrypotter.fandom.com/wiki/Harry_Potter:_Quidditch_World_Cup",
  "summary": "The game does not state it explicitly, but the rosters and the fact that the World Cup follows the Hogwarts school year in this game indicates that the game is set during Harry Potter's third year, the 1993–1994 school year. Furthermore, because the books have not named all of the members of the Hogwarts House teams, the video game has filled in the gaps as follows, circa Harry's third year. At the top of the screen and attached to both teams' scores is a Golden Snitch gauge, signalling both the teams' relative momentum and how close the climactic Snitch chase is. Successfully following the Snitch's path regenerates the boost metre faster, and successfully catching the Snitch, as always, awards 150 points and ends the game. Furthermore, the scores are locked in during the Snitch chase, meaning that no goals are scored during the chase\nAs the player progresses in the House Quidditch Cup and completes more drills, he or she also unlocks more features that also charge with momentum banked in the Snitch gauge:\nThe introduction features Harry and Oliver Wood dressed in their Gryffindor Quidditch team uniforms instructing the player on the basic rules and objectives of Quidditch."
 },
 "hogwarts legacy": {
  "link": "http://harrypotter.fandom.com/wiki/Hogwarts_Legacy",
  "summary": "Developed by Avalanche Software and published by Warner Bros. Interactive Entertainment under the Portkey Games label, the game will be released on PlayStation 4, PlayStation 5, Xbox One, Xbox Series X/S, and PC in 2022. The game was originally leaked on Reddit in October 2018 alongside an unofficial trailer which showed an extensive character creation, spell-casting, magical creatures, and exploration. No official comment was given by either Warner Bros nor J. K. Rowling, although many reputable sources inside WB Avalanche, including high ranking employees, teased or claimed to know of the game. [3][4][5][6]\nThe game was announced via a video game showcase stream by Sony on 16 September, 2020. [7] It was set to be available to players in 2021, but the date was later delayed to 2022 to continue developing the game for a better experience for players."
 },
 "the tales of beedle the bard real": {
  "link": "http://harrypotter.fandom.com/wiki/The_Tales_of_Beedle_the_Bard_(real)",
  "summary": "The Tales of Beedle the Bard is a book written by British author J. K. Rowling, which was published on December 4, 2008. Issued nearly a year and a half after Harry Potter and the Deathly Hallows, it stood as the most recent book published based upon the Harry Potter universe before the release of Harry Potter and the Cursed Child in July 2016. The book purports to be the storybook of the same name mentioned in Harry Potter and the Deathly Hallows, the last book of the Harry Potter series at that time. The book was originally produced in a limited edition of only seven copies, each handwritten and illustrated by J. K. Rowling. One of them was offered for auction in late 2007 and was expected to sell for £50,000 (~US$103,000, ~€80,000); ultimately it was bought for £1.95 million (~$3.98 million, ~€2.28 million) by Amazon.com, making the selling price the highest achieved at auction for a modern literary manuscript. The book was published for the general public on 4 December 2008, with the proceeds going to the Children's High Level Group. Originally, The Tales of Beedle the Bard had only been produced in a limited number of seven handmade copies, all handwritten and illustrated by the author herself. The books were bound in brown morocco leather, and decorated with hand-chased silver ornaments and mounted semiprecious stones by silversmith and jeweller Hamilton & Inches of Edinburgh (they also worked with Rowling on a charm bracelet she auctioned)."
 },
 "actors realworld": {
  "link": "http://harrypotter.fandom.com/wiki/Category:Actors_(real-world)",
  "summary": ""
 },
 "maggie smith": {
  "link": "http://harrypotter.fandom.com/wiki/Maggie_Smith",
  "summary": "In her career, Smith has won two Academy Awards out of her six nominations: Best Actress in a Leading Role in 1970 for The Prime of Miss Jean Brodie, and Best Actress in a Supporting Role in 1978 for California Suite. For TV, she has won two Primetime Emmy Awards: Outstanding Lead Actress in Miniseries or a Movie for My House in Umbria, and Outstanding Supporting Actress in Miniseries or a Movie for Downton Abbey. After that she has been acting with the most prominent actors and actresses in the world in over sixty films and TV-series, including The Prime of Miss Jean Brodie (1969), California Suite (1978) with Michael Caine and Jane Fonda, A Room with a View (1985), Hook (1991) with Dustin Hoffman, Robin Williams and Julia Roberts, Sister Act and Sister Act II: Back In The Habit (1992-1993) with Whoopi Goldberg, Franco Zeffirelli's Tea with Mussolini (1999) with Judi Dench, Joan Plowright and Cher, and Gosford Park (2001) with Kristin Scott Thomas and Clive Owen, directed by Robert Altman. In 2001, Maggie Smith made her appearance  as the formidable Professor McGonagall for the first time in the film adaptation of Harry Potter and the Philosopher's Stone. In 2011, she voiced the animated character of \"Lady Bluebury\" in Gnomeo & Juliet, and reprised the role in its 2018 sequel, Sherlock Gnomes. First on 29 June, 1967 to actor Robert Stephens and had two sons with him, Chris Larkin and Toby Stephens, both actors."
 },
 "colby frey": {
  "link": "https://harrypotter.fandom.com/wiki/Colby_Frey",
  "summary": "They befriended Cassandra Vole, and she led their group in bullying their fellow students including Daniel Page. [3]\nThey went to the Library one night to find a newspaper article about Daniel. Daniel, Ivy Warrington and their friend found out that they had broken curfew and went to find out why. [3]\nColby had a mean-spirited personality and enjoyed bullying others with his friends. [3] He was known to enjoy Herbology, handcraft and poetry, and he disliked History of Magic which he was not good at."
 },
 "harry potter and the deathly hallows part 2 video game": {
  "link": "http://harrypotter.fandom.com/wiki/Harry_Potter_and_the_Deathly_Hallows:_Part_2_(video_game)",
  "summary": "(*Have to unlock in multiplayer mode by getting Dark Mark Tokens)\nGringotts\nMusic - Wandering Part 1: SorrowChallenge - Challenge 1: GringottsCharacter - Ron WeasleyCharacter - Scabior\nThe Streets of Hogsmeade\nMusic - Wandering Part 2: Determination Character - Death EaterChallenge - Challenge 2: The Streets of HogsmeadeCharacter - Professor Snape\nA Problem of Security\nMusic - Wandering Part 3: MysteryCharacter - Amycus CarrowCharacter - Alecto CarrowChallenge - Challenge 3: A Problem of Security\nThe Basilisk Fang\nCharacter - Aberforth DumbledoreMusic - Wandering Part 4: SerenityCharacter - Professor McGonagallChallenge - Challenge 4: The Basilisk Fang\nA Job to Do\nMusic - Wandering Part 5: Dark MagicCharacter - Seamus FinniganCharacter - Neville LongbottomMusic - Wandering Part 6: TensionChallenge - Challenge 5: A Job to Do\nThe Lost Diadem\nMusic - Wandering Part 7: SurrenderCharacter - Gregory Goyle\nCharacter - Draco MalfoyChallenge - Challenge 6: A Giant ProblemChallenge - Challenge 7: The Lost DiademCharacter - Blaise Zabini\nThe Battle of Hogwarts\nCharacter - Fenrir GreybackMusic - Combat Part 1: CourageCharacter - Bellatrix LestrangeMusic - Combat Part 2: Fear at HogwartsCharacter - Hermione GrangerChallenge - Challenge 8: The Battle of Hogwarts\nA Turn of Events\nMusic - Combat Part 3: Battle to the Vault\nChallenge - Challenge 9: SurrenderChallenge - Challenge 10: A Turn of EventsCharacter - Harry Potter\nNot My Daughter\nChallenge - Challenge 11: Not My DaughterCharacter - Molly WeasleyCharacter - Ginny WeasleyMusic - Combat Part 4: Securing the Bridge\nVoldemort's Last Stand\nChallenge - Challenge 12: Voldemort's Last StandCharacter - Lord VoldemortMusic - Combat Part 5: The Final Duel\nAt the very end of the game, after the credits are done or have been skipped, there is a short video montage featuring clips from all nine games (including Quidditch World Cup)."
 },
 "harry potter and the goblet of fire": {
  "link": "http://harrypotter.fandom.com/wiki/Harry_Potter_and_the_Goblet_of_Fire",
  "summary": "Harry Potter and the Goblet of Fire is the fourth book in the Harry Potter series by J. K. Rowling, published in 2000. This book is seen by many fans as the beginning of darker times in the wizarding world, as it shows the return of Voldemort. \"To Peter Rowling, in memory of Mr Ridley and to Susan Sladden, who helped Harry out of his cupboard\"\nPeter Rowling is JK Rowling's father. It is not certain who exactly Susan Sladden is, but she could be the Susan Jo once referred to in an interview as the woman who used to look after Jessica (Jo's daughter) while Jo worked on the Harry Potter books. Harry wants to get away from the pernicious Dursleys and go to the Quidditch World Cup with Hermione, Ron, and the Weasleys. He wants to find out about the mysterious event to take place at Hogwarts this year, an event involving two other rival schools of magic, and a competition that hasn't happened for hundreds of years. But unfortunately for Harry Potter, he's not normal - not even by Wizarding standards. Thomas and Mary Riddle, with their grown-up son Tom Riddle Senior, have been considered the most unpopular people occupying the Riddle House, located on a hill overlooking the Yorkshire County village of Little Hangleton, many decades ago. Thomas was a snobbish squire who had the worst attitude that nobody wanted in a village leader, while Mary did retailing for Lady Margaret Nurseries branch of the British Association of Garden Centres."
 },
 "runestone": {
  "link": "https://harrypotter.fandom.com/wiki/Runestone",
  "summary": "During the Calamity which occurred throughout the 2010s, these mysterious magical stones started appearing throughout the wizarding world. They allowed volunteer members of the Statute of Secrecy Task Force to participate in magical challenges in Fortresses, such as duelling other wizards or fighting aggressive and dangerous creatures, such as Acromantulas and Werewolves."
 },
 "neville longbottom": {
  "link": "https://harrypotter.fandom.com/wiki/Neville_Longbottom",
  "summary": "30 July 1980)[1][2] was a British pure-blood[3] wizard, the only child and son of Frank and Alice Longbottom. They were placed in the Janus Thickey Ward at St Mungo's Hospital for Magical Maladies and Injuries, leaving Neville to be raised by his grandmother, Augusta Longbottom. Neville began school at Hogwarts School of Witchcraft and Wizardry in 1991 and was sorted into Gryffindor House, along with Harry Potter, Hermione Granger, and Ronald Weasley. Throughout his school years, he was mostly a shy, clumsy, introverted boy who was constantly being told by his grandmother that he was not good enough or living up to his parents' accomplishments. However, in his later years, he showed that he possessed great courage and perseverance: he became an important member of Dumbledore's Army, an organisation taught and led by Harry Potter with the goal of helping other students learn spells to attack and defend themselves. Neville would later fight in the Battle of the Department of Mysteries (1996), the Battle of the Astronomy Tower (1997), and the Battle of Hogwarts (1998). During the Battle of Hogwarts, having refused Voldemort's invitation to join the Death Eaters, he destroyed the seventh and final Horcrux when he beheaded the snake Nagini. After the end of the Second Wizarding War, Neville briefly served as an Auror, before becoming Hogwarts' professor of Herbology and marrying Hannah Abbott from Hufflepuff. Neville Longbottom was born on 30 July, 1980, to Frank and Alice Longbottom, a pair of Aurors. [1][2] Moments after his birth, Neville was able to adjust his blankets so that he was swaddled more snugly, but no one witnessed this unusually precocious display of underage magic."
 },
 "harry potter and the philosophers stone video game": {
  "link": "http://harrypotter.fandom.com/wiki/Harry_Potter_and_the_Philosopher%27s_Stone_(video_game)",
  "summary": "Harry Potter and the Philosopher's Stone (Harry Potter and the Sorcerer's Stone in its original American title) is a set of video games based on J. K. Rowling's first book in the Harry Potter series and the 2001 film adaptation. Harry Potter and the Philosopher's Stone gameplay is from a third-person perspective. [1]\nIn the various versions of the game, save game books appear throughout each level at various stages such as the Forbidden Forest, Hogwarts Castle, Hagrid's Hut, etc. Saving the game allows the player's progress to be restored from that point, proving useful before taking on difficult sequences. In the Microsoft Windows and Macintosh versions, the game is played like a third-person action and puzzle game. However, the story is arranged in a completely different fashion to the PC version, and features different story events and gameplay. In the PS1 version of the game, various manuals appear in the game world which display the game's controls. The Game Boy Color game is a role-playing game, similar to games like Final Fantasy."
 },
 "r": {
  "link": "https://harrypotter.fandom.com/wiki/R",
  "summary": "Shrouded in mystery and operating largely in complete secrecy, while little was known about its origins and motives, and even though the identities of its members was largely unknown, it was eventually discovered by Alastor Moody that it consisted of a group of Dark Wizards that dealt in the illicit acquisition of arcane knowledge, magical artefacts and unlocking the path to immortality,[3] and whose ruthless pursuit for power had given rise to various clandestine operations around the world. [4] They were also known to have had sufficient political influence to facilitate the continued concealment of their unlawful activities; having at some point successfully infiltrated the Ministry of Magic in London and been able to search for the fabled Cursed Vaults for more than half a decade before the Ministry even received their first reports that their cabal existed; at which point its members had already acquired enough sway to issue commands to the guards at the fortress of Azkaban; having at one point ordered a Dementor to leave its post in Azkaban and attack Hogwarts School of Witchcraft and Wizardry without being discovered. Two school years later, they wrote to both Jacob's sibling and Patricia Rakepick, telling Rakepick to step aside from Hogwarts. That same year, a mysterious cloaked figure told Jacob's sibling to avoid the Cursed Vaults, Patricia Rakepick and the Forbidden Forest. It is possible that the messenger was a member of, or sent by, R. R later sent a Dementor to Hogwarts to test Jacob's sibling. [5]\nEven after the final Cursed Vault was sealed and Rakepick was lost, R was still not finished in their crusade of seeking power and immortality. With the help of Mundungus Fletcher, Jacob's sibling found out in Knockturn Alley (while wearing an invisibility cloak) that the Hogwarts mole was really their long thought-to-be friend Merula Snyde."
 },
 "harry potter and the goblet of fire video game": {
  "link": "https://harrypotter.fandom.com/wiki/Harry_Potter_and_the_Goblet_of_Fire_(video_game)",
  "summary": "The video game adaptation of Harry Potter and the Goblet of Fire was released in November 2005 for seven platforms: PC, PlayStation 2 (PS2), Xbox, GameCube, PlayStation Portable (PSP), Nintendo DS, and Game Boy Advance (GBA). The third title in EA's action-adventure Harry Potter franchise, it has a unique feel and gameplay, with elements not present in any other game of the franchise, including a camera of a 3D environment that is not player-controlled and a system in which previous levels can be played again at will. Due to higher-quality graphics in comparison to previous Harry Potter video games,[1] characters more closely resemble their movie counterparts. The PSP version was released in North America on 15 November and in Europe on 18 November, the same day the film premiered. Instead, the player selects one among several nonconsecutive levels to play on a special menu that shows Dumbledore's pensieve. Just like the previous game, the three playable characters are Harry Potter, Hermione Granger, and Ron Weasley; namely the main characters in the movie. In this game, however, the player(s) can choose which one(s) to control at the beginning of each level (with a few exceptions, such as the Triwizard tasks, in which only Harry appears). Similarly to Prisoner of Azkaban, also, the three characters can cast collaborative spells that are more powerful or produce better results, which can happen either in solo or in multiplayer."
 },
 "exstimulo potion": {
  "link": "https://harrypotter.fandom.com/wiki/Exstimulo_Potion",
  "summary": "This potion was brewed and used heavily by volunteer wizards and witches employed by the Statute of Secrecy Task Force, to help address the issue of the Calamity in the 2010s. It allowed the drinker to boost the magical power of their spell casts, and was particularly practical when dealing with Confoundables and engaging in Wizarding challenges in Fortresses."
 },
 "harry potter and the prisoner of azkaban": {
  "link": "https://harrypotter.fandom.com/wiki/Harry_Potter_and_the_Prisoner_of_Azkaban",
  "summary": "Harry Potter and the Prisoner of Azkaban is the third instalment novel in the Harry Potter series written by J. K. Rowling. To Jill Prewett and Aine Kiely, the Godmothers of Swing\nJill Prewett and Aine Kiely were JK Rowling's flatmates when she lived in Portugal. Because they spent so much time there, Jo called themselves its godmothers. \"Harry Potter is lucky to reach the age of thirteen, since he has already survived the murderous attacks of the feared Dark Lord on more than one occasion. But his hopes for a quiet term concentrating on Quidditch are dashed when a maniacal mass-murderer escapes from Azkaban, pursued by the soul-sucking Dementors who guard the prison. Harry Potter spends another summer holiday with the Dursleys in mid-1993, and things haven't been that easy for him. Over the summer, the Dursleys have forbidden him to talk to any of the neighbours out of fear of him exposing his magical abilities. have become a real problem for Harry, too, because his teachers at Hogwarts School of Witchcraft and Wizardry have given him a lot of summer homework. He has seized the opportunity to start it a week after his arrival home by sneaking some of his books upstairs and hiding them in his room while Aunt Petunia and Dudley go out to admire Uncle Vernon's new company car."
 },
 "pottermore": {
  "link": "https://harrypotter.fandom.com/wiki/Pottermore",
  "summary": "Pottermore was an official Harry Potter website created by J. K. Rowling. It began with interactive features such as games and let the user follow each chapter of Harry Potter from the Philosopher's Stone to the ending of the Deathly Hallows. [1]\nIn 2016, Pottermore was remade and relaunched in the style of a blog. Focusing mainly on new writing from Rowling, news and special feature articles, it allows the user to make a more private profile where they are sorted in both their Hogwarts and Ilvermorny house. Since it began, Pottermore has posted some of Rowling's extensive collection of work with over 18,000 words. [2] Pottermore also has a shop where eBook editions of the books were available for purchase for the first time. Before it opened, one million people received a chance to preview the site before its general launch in early April 2012. Pottermore was available to the general public for free up until it was rebranded in 2019 as  Wizarding World. Fans had to use coordinates revealed among ten Harry Potter fan sites to piece together a word that would be the subject of her announcement."
 },
 "rubeus hagrid": {
  "link": "http://harrypotter.fandom.com/wiki/Rubeus_Hagrid",
  "summary": "6 December 1928)[11][12] was an English half-giant wizard, son of Mr Hagrid and the giantess Fridwulfa, and elder half-brother of the giant Grawp. In Hagrid's third year, he was framed by Tom Riddle for the crime of opening the Chamber of Secrets and using his pet Acromantula to attack several Muggle-born students and eventually killing one of them. Though Hagrid's wand was snapped and he was expelled, he was trained as gamekeeper of Hogwarts and allowed to live on the school grounds at the request of Albus Dumbledore. As a member of both the original and the re-instated Order of the Phoenix, Hagrid fought in several battles of the First and the Second Wizarding Wars, including the Battle of Hogwarts in 1998. By 2017, he was still living, and presumably still teaching and tending to his gamekeeping duties at Hogwarts, inviting Harry's son Albus Severus for tea when he joined the school as Harry informed him at the station, just as Hagrid had done for his father, Ron Weasley and Hermione Granger. Hagrid was born on 6 December 1928 to Mr Hagrid, a wizard, and Fridwulfa, a giantess, and grew up in the West Country of England, near the Forest of Dean, where he acquired his distinctive accent. [13][14]\nWhen Hagrid was about three, his mother returned to her Giant colony, leaving his father to raise him alone. Hagrid said he had very few memories of his mother from his childhood, but remembered his father fondly; as a half-giant, he overtook his father in size by the age of six, and amused the \"tiny\" wizard by picking him up and setting him on top of a dresser when Hagrid was annoyed with him. Hagrid's father was thrilled when his son was accepted at Hogwarts School of Witchcraft and Wizardry, where Hagrid began his education in 1940 in which he was Sorted into Gryffindor House."
 },
 "tom felton": {
  "link": "http://harrypotter.fandom.com/wiki/Tom_Felton",
  "summary": "Born in Kensington, London, he grew up in Epsom with his mother, Sharon, his father, Peter, and his three older siblings, Jonathan, Ashley and Chris. Felton first came to attention in 1997 when he was featured in a number of top television commercials, in some of which he took the starring role. He shot to fame, and in 1996 he played the part of Peagreen Clock in Peter Hewitt's The Borrowers, and later as Louis in the film Anna and the King which also starred Jodie Foster. Rumours spread of Tom taking part in the series Home Farm Twins, but the show never came out of cancellation. Before the Harry Potter years, in 1995, he was also known to have performed as the voice of James on the television series \"Bugs\". More recently though, he has become known for his portrayal of Draco Malfoy in the Harry Potter films. Felton has also been in several later TV series, namely Second Sight I and II playing witness Thomas Ingham opposite Clive Owen. He also enjoys football, ice-skating, rollerblading, basketball, cricket, swimming and tennis. At age 11, he worked in a fishery, partially due to his passion."
 },
 "lego harry potter years 14": {
  "link": "https://harrypotter.fandom.com/wiki/LEGO_Harry_Potter:_Years_1-4",
  "summary": "A special Collector's Edition version of the game was released containing a Behind the scenes look at the game, a free set of avatar clothes if the game is for Xbox 360, an exclusive set of House crest magnets, and an interview on the making of Deathly Hallows. The game, along with Years 5-7 was re-released for the PlayStation 4 on October 21, 2016 as a remastered collection including updated graphics and resolution, as well as including all the previously released DLCs. The game is based on the first four books and films of the Harry Potter series: Philosopher's Stone, Chamber of Secrets, Prisoner of Azkaban and Goblet of Fire. The main playable characters are Harry, Ron, and Hermione. The game features a total of 167 characters who can be unlocked by finding the special tokens hidden around Hogwarts secret places and level missions, and then buying them at Madam Malkin's shop. Harry and his friends learn how to use spells, charms, jinxes, and prepare potions, as well as visiting a lot of familiar places like Hogwarts Castle, Diagon Alley, the Forbidden Forest, and Hogsmeade. The main characters (Harry, Ron and Hermione) are controlled since the start of the game but some of them can be found in the missions and hidden places. The majority of characters featured can be controlled however giant creatures like the troll, the Salazar Slytherin's basilisk or the Hungarian Horntail cannot be playable as well as the Dementors or Firenze."
 },
 "harry potter and the halfblood prince film": {
  "link": "https://harrypotter.fandom.com/wiki/Harry_Potter_and_the_Half-Blood_Prince_(film)",
  "summary": "Harry Potter and the Half-Blood Prince is a British-American fantasy film based on the sixth novel by J. K. Rowling, released on 15 July, 2009. David Yates returned to direct the sequel to Harry Potter and the Order of the Phoenix, as did David Heyman and David Barron to produce,[3] and Steve Kloves, though he did not write the fifth film, returned to write. [4] Reprising their roles from earlier films are Daniel Radcliffe, Rupert Grint, Emma Watson, Helena Bonham Carter, Robbie Coltrane, Michael Gambon, Alan Rickman, Maggie Smith, Timothy Spall, David Thewlis, Julie Walters, Bonnie Wright, David Bradley, Warwick Davis, Tom Felton, Gemma Jones, Natalia Tena and Mark Williams, while Jim Broadbent and Helen McCrory make their debut for the series. Unlike the previous film, the sixth film was released in regular theatres on 15 July and IMAX 3-D on 29 July because of the IMAX release of Transformers: Revenge of the Fallen. [5] The film was chosen to be screened at the Royal Film Performance on 17 November, 2008, but due to the date of release being pushed back, it was not shown. On 7 July, 2009, at the world premiere of Half-Blood Prince in London, the cast and crew all wore white ribbons in memory and tribute of 18-year-old British actor and co-star Robert Knox. Together they work to find the key to unlock Voldemort's defences and, to this end, Dumbledore recruits his old friend and colleague, the well-connected and unsuspecting bon vivant Professor Horace Slughorn, whom he believes holds crucial information."
 },
 "fantastic beasts the crimes of grindelwald": {
  "link": "https://harrypotter.fandom.com/wiki/Fantastic_Beasts:_The_Crimes_of_Grindelwald",
  "summary": "Fantastic Beasts: The Crimes of Grindelwald, or just The Crimes of Grindelwald, is a direct sequel to Fantastic Beasts and Where to Find Them, and the second instalment of the series of films based on Fantastic Beasts and Where to Find Them, one of the companion books to J. K. Rowling's Harry Potter series, overall, being the tenth film set in the wizarding world. Returning stars Eddie Redmayne, Katherine Waterston, Dan Fogler, Alison Sudol, Ezra Miller, Carmen Ejogo, Kevin Guthrie, and Johnny Depp, with Zoë Kravitz, Callum Turner, Claudia Kim, William Nadylam, and Jude Law joining the cast. The plot follows Newton Scamander and Albus Dumbledore as they attempt to take down Gellert Grindelwald, while facing new threats in a more divided wizarding world. The story takes place in New York, London, and Paris starting around 19 March,[3] 1927. It was released in most countries on 16 November, 2018, the same day the screenplay was published[5] although it was technically released days earlier in certain countries such as France and Argentina. But Dumbledore will need help from the wizard who had thwarted Grindelwald once before, his former student Newt Scamander. However, the mission against Grindelwald will ‘test their loyalties’ as the wizarding world becomes more divided and dangerous. [6]\nIn 1927, the powerful Dark wizard Gellert Grindelwald is being held prisoner by the Magical Congress of the United States of America (MACUSA)."
 },
 "rowan khanna": {
  "link": "http://harrypotter.fandom.com/wiki/Rowan_Khanna",
  "summary": "Rowan Khanna (December[1] 1972–1990)[2] was a wizard or witch who began attending Hogwarts School of Witchcraft and Wizardry in 1984. Their family owned a farm that supplied high-quality wood for the manufacture of wands and broomsticks. Their family owned a farm that supplied high-quality wood for the manufacture of wands and broomsticks. [9]\nWhile shopping for school supplies in Diagon Alley, Rowan met and befriended future fellow student and housemate, Jacob's sibling, to whom Rowan advised starting with Flourish and Blotts. When the shopping concluded, Rowan and Jacob's sibling promised to see each other again on the train. [9]\nRowan began attending Hogwarts School of Witchcraft and Wizardry in 1984 and was Sorted into the same House as Jacob's sibling. [10]\nBefore the start of their first Potions class, Jacob's sibling found Merula Snyde, an imperious and cruel Slytherin witch, trying to bully Rowan into admitting her as the most powerful witch to in Hogwarts. Rowan tried to reason with Merula by listing out other factors, but Merula wouldn't budge, which prompted Jacob's sibling to intervene on Rowan's behalf and stand up for their friend. [10]\nLater when their Prefect decided to teach Jacob's sibling how to duel, Rowan helped Jacob's sibling find a duelling book in the Artefact Room, where Jacob's sibling saw some visions and heard a mysterious voice saying a kind of ice was here and a vault would open."
 },
 "19th century": {
  "link": "http://harrypotter.fandom.com/wiki/19th_century",
  "summary": ""
 },
 "wonderbook book of spells": {
  "link": "http://harrypotter.fandom.com/wiki/Wonderbook:_Book_of_Spells",
  "summary": "Wonderbook: Book of Spells, or simply Book of Spells, is a video game/augmented reality book created by Sony and J. K. Rowling,[2] released on 13 November, 2012[1] as part of the Pottermore partnership. Using the Playstation Eye Camera and the Wonderbook technology, Book of Spells provides an augmented reality experience, making it seem as if the events of the book are taking place around you. It is set up as a textbook, providing information on spells such as the Fire-Making Spell, Disarming Charm, Levitation Charm and Unlocking Charm as well as allowing readers to practise said spells. It also provides new content from J.K. Rowling, such as backstory on the book's various spells and new info on creatures."
 },
 "harry potter film series": {
  "link": "https://harrypotter.fandom.com/wiki/Harry_Potter_(film_series)",
  "summary": "Beginning in 2001, Warner Bros. Pictures began releasing the Harry Potter films, adaptations of the Harry Potter books. These films have proven to be very popular and, in less than a decade, the Harry Potter film series became the highest-grossing motion picture series in history, surpassing the world-famous James Bond franchise. [1]\nIn 1997, David Heyman received a copy of Harry Potter and the Philosopher's Stone. Heyman was very impressed by Rowling's work, which led to Rowling selling him the film rights for four books in 1999. She wanted the principal cast to be played by British actors, but allowed Irish actors, unless the role required otherwise. She also wanted a part in helping them adapt the books, and refused to give the rights of her characters to Warner Bros which would let them make non-author written sequels. Rowling was given a large creative role which Columbus was fine with, while Heyman stayed to produce it. Heyman persuaded his parents to let him audition and Rowling was very impressed, saying she didn't think there would be a better choice."
 },
 "individuals": {
  "link": "https://harrypotter.fandom.com/wiki/Category:Individuals",
  "summary": ""
 },
 "invigoration draught": {
  "link": "https://harrypotter.fandom.com/wiki/Invigoration_Draught?title=Invigoration_Draught&mobileaction=toggle_view_mobile",
  "summary": "[1] Fifth year students of Potions class were required to brew an Invigoration Draught, which was supposedly rather easy to do when left alone."
 },
 "portkey portmanteau": {
  "link": "https://harrypotter.fandom.com/wiki/Portkey_Portmanteau",
  "summary": "[1]\nIn the 21st century, Portkey Portmanteaus were distributed by the Ministry of Magic to members of the Statute of Secrecy Task Force to assist with the efforts to address the Calamity."
 },
 "grim fawley": {
  "link": "http://harrypotter.fandom.com/wiki/Grim_Fawley",
  "summary": "[8]\nAt the age of eleven, Grim received an acceptance letter from Hogwarts School of Witchcraft and Wizardry. [9]\nGrim Fawley started at Hogwarts School of Witchcraft and Wizardry on 1 September 1996, and was Sorted into Hufflepuff House. [10] His early years at Hogwarts coincided with the height of the Second Wizarding War: the end of his first year was marked by the infiltration of the school by a group of Death Eaters and the killing of the Headmaster, Albus Dumbledore; during his his second year, following the fall of the Ministry of Magic, the school headed by Severus Snape, and the students were left largely at the mercy of his sadistic deputies, Death Eaters Amycus and Alecto Carrow. [8] From that point on, Grim spent the rest of his childhood in the care of orphanages, and rarely spoke about it in later years. [11]\nGrim returned to Hogwarts to complete his education; in spite of the great personal tragedy, Grim remained an outstanding student and Headmistress Minerva McGonagall would later go on to describe him as \"A Hufflepuff through and through\",[10] meaning he embodied all of the qualities that marked his House, such as hard work, dedication and loyalty. [12]\nGrim finished his education in 2003 with an impressive academic record, having earned five Outstandings and one Exceeds Expectations on his six N.E.W.T.s, and a \"glowing recommendation\" from Minerva McGonagall herself. [10]\nAn accomplished wizard, Grim Fawley joined the Ministry of Magic following his graduation from Hogwarts, having been hired by the Ministry's research wing, he was assigned to the Department of Magical Law Enforcement."
 },
 "j k rowling a year in the life": {
  "link": "http://harrypotter.fandom.com/wiki/J.K._Rowling:_A_Year_in_the_Life",
  "summary": "The film follows J. K. Rowling over the course of a long year as she completes her work on the last Harry Potter novel, Harry Potter and the Deathly Hallows. This documentary also includes many extensive interviews with J. K. Rowling, as well as several clips of her promoting Deathly Hallows and at the launch. It was also aired on the ABC Television Network in America on Thursday, 16 July, 2009 from 8-9pm (ET), the weekend of the release of the film Harry Potter and the Half-Blood Prince. [1]\nJ. K. Rowling: A Year in the Life was later included on the \"Special Features\" DVD of Harry Potter and the Half-Blood Prince."
 },
 "ivy warrington": {
  "link": "http://harrypotter.fandom.com/wiki/Ivy_Warrington",
  "summary": "She had a grandmother who was a witch, and one sister, Winifred Warrington. [4]\nAt one point during her childhood, Winifred vanished herself. Ivy had an ability to vanish, and would do so even when she didn't intend to. [4]\nAt the age of eleven, Ivy began attending Hogwarts School of Witchcraft and Wizardry. During the Sorting Ceremony, Ivy was at first missing, having been distracted by bushes outside the castle, but was later found by Rubeus Hagrid."
 },
 "policy": {
  "link": "http://harrypotter.fandom.com/wiki/Harry_Potter_Wiki:Policy",
  "summary": "The first commandment of the wiki, implicitly agreed upon by generations of wiki editors, and from which stem most of the policies stated herein, such as spelling conventions and in-universe points of view, is:\nFirst and foremost, the Harry Potter Wiki is exactly that - a wiki, or an editable online encyclopedia on the Harry Potter universe. We host information, facts, images, and official theories related to Harry Potter on this site, as well as discussions about the material presented here. We do not entertain any fan fiction, images, or ramblings (collectively \"fanonsense\"), Harry Potter game cheats or walkthroughs, advertisements, spam, or articles not directly associated with the Harry Potter universe. You may talk about anything which you like on your talk page, or add the same in your namespace, as long as it is legal. If you don't have anything of real informative value to contribute and if you don't want to help out in editing or monitoring - in short, if you don't want to be a productive community member - then this probably is not the site for you. text, images, music) must be in the public domain; unless you have obtained permission to use them publicly, copyrighted files will be removed, no matter how nicely written or beautifully shot. Quotes, facts, and figures may be taken from anywhere, as long as they are sourced (see below for HP referencing templates). Any users or editors who repeatedly refuse to follow these rules may be banned at the discretion of any administrator, and their contributions deleted. If you see an act of vandalism, please revert the page to its original state and report the vandal."
 },
 "gethsemane prickle": {
  "link": "http://harrypotter.fandom.com/wiki/Gethsemane_Prickle",
  "summary": "[2]\nThe scion of a family of unknown wizarding descent, Gethsemane Prickle was born somewhere in the British Isles and presumably attended Hogwarts School of Witchcraft and Wizardry during her formative years, as is the case with nearly all magical children born in the wizarding community of Great Britain. [3] In adulthood, Madam Prickle became an accomplished Herbologist and Potioneer, and eventually, she found employment at the British Ministry of Magic, where she was hired by the Ministry's research wing and was assigned to the Department for the Regulation and Control of Magical Creatures. [4]\nLater in her career, she would eventually find herself called in for consultation by the Beast Division more than once, and assist among others Mathilda Grimblehawk and her partner in solving investigations tied to creature-related incidents. [5][6]\nAt some point prior to 2006, she learned that a woman by the name of Penelope Padgett had joined the Department of Magical Law Enforcement and sent a memo to the Head of the Auror Office, Harry Potter, and tried unsuccessfully to warn him about her, suspecting that she had ill-intentions, as her parents had been strong and outspoken supporters of Lord Voldemort during the Second Wizarding War. [7][8] Having carried out her duties to the satisfaction of her superiors for a number of years, she was eventually promoted to Head of Department by 2019. [9][10]\nAfter the Ministry of Magic became the Calamity World Centre in the wizarding world, she went on to help prepare members of the newly-created Statute of Secrecy Task Force who sought a career as Magizoologist prepare for the threat they would be facing. [11] She would later on task one of them with sorting out an infestation of Doxies from the drapes somewhere at the Calamity World Centre, which would improve their spell-casting to the point of making it easier to hit evasive foes. [11] At some point, she would also advise at least one of the members of the aforementioned task force to live among Centaurs."
 },
 "lego harry potter years 57": {
  "link": "http://harrypotter.fandom.com/wiki/LEGO_Harry_Potter:_Years_5-7",
  "summary": "\nLEGO Harry Potter: Years 5-7 is the sequel to LEGO Harry Potter: Years 1-4 and was released 11 November, 2011 in North America and 18 November, 2011 in Europe. [3]\nLike its immediate predecessor, many events from the books and films have been changed for comedic purposes as well as to better accommodate two player co-op. The game, along with Years 1-4, were re-released for the PlayStation 4 on October 21, 2016, as a remastered collection including updated graphics and resolution, as well as including all the previously released DLCs. Based on the last three Harry Potter books and final four Harry Potter films, LEGO® Harry Potter: Years 5-7 takes players through Harry Potter’s heroic adventures in the Muggle and wizarding worlds. From Privet Drive in Little Whinging to Diagon Alley, Hogsmeade, and Hogwarts – plus new locations including Grimmauld Place, the Ministry of Magic, and Godric's Hollow – players will encounter new faces, new challenges and new magic, preparing them for the ultimate face-off against Lord Voldemort himself — all in LEGO style. Note that, as was the case with the previous game, many of these changes were made to either make the game more co-op friendly, and/or to tell a parodic/humorous version of the story. The first pack of downloadable content, also known as DLC, was made available for the game on 13 December, 2011 for Xbox 360, and the next day for PlayStation 3. The characters are as follows:\nThe second pack of DLC was made available for the game on 7 February, 2012 for Xbox 360 and PlayStation 3."
 },
 "albus dumbledore": {
  "link": "http://harrypotter.fandom.com/wiki/Albus_Dumbledore",
  "summary": "[25] (c. Summer[1] 1881[3] – 30 June, 1997)[3] was an English half-blood wizard. He was the Defence Against the Dark Arts Professor, later the Transfiguration Professor, and later the Headmaster of Hogwarts School of Witchcraft and Wizardry. His father died in Azkaban when Albus was young, while his mother and sister were later accidentally killed. While initially unable to directly act against Gellert Grindelwald due to their past Blood pact, the Ministry's surveillance of him, his love for Grindelwald, and his lingering guilt over his sister's death, Dumbledore sent Newt Scamander to New York to release the Thunderbird Frank, and later sent Newt to Paris to rescue Credence Barebone. After the tragic death of Leta Lestrange in Paris, Dumbledore became determined to contribute helpful advice to the resistance against Grindelwald, notably Newt, Theseus, Tina, Jacob, Yusuf, and Nagini in the Global wizarding war. Initially unbeknownst to Dumbledore, however, Grindelwald intended to use the former's alleged Obscurial relative, Aurelius Dumbledore, as a weapon against him."
 },
 "fantastic beasts cases from the wizarding world": {
  "link": "https://harrypotter.fandom.com/wiki/Fantastic_Beasts:_Cases_from_the_Wizarding_World",
  "summary": "The player's character is partnered with Mathilda Grimblehawk, a fellow employee in the Beast Division, to solve cases that centre around the uncovering and protection of magical beasts. Gameplay requires the player to find hidden objects, cast spells, brew potions, and identify beasts to solve the mystery. [1] The various cases take the player to familiar locations in the wizarding world, such as the Leaky Cauldron, Diagon Alley and Hogsmeade, as well as to other unfamiliar ones. [3]\nThe Keeper for the Chudley Cannons, Gordon Horton, was found injured on the Cannons' training grounds; Grimblehawk and her partner are tasked to identify the mystery attacker. Muggle construction workers, led by foreman Don Harrison, were attacked when beginning their construction project on a forest home to magical species. Wizard Bilius Finbok was reported to have disappeared from his home, while the Ministry of Magic had also received reports of a strange affliction plaguing Muggle livestock. Prompted by the disappearance of wizard Philbert Chivers and complaints of wailing sounds from toilets received by the Muggle Liaison Office, Grimblehawk and her partner set off to investigate the sewers of London for beastly activity."
 },
 "harry potter and the order of the phoenix film": {
  "link": "http://harrypotter.fandom.com/wiki/Harry_Potter_and_the_Order_of_the_Phoenix_(film)",
  "summary": "Harry Potter and the Order of the Phoenix is a British-American fantasy film based on the fifth novel by J. K. Rowling, released on 11 July, 2007 in the U.S. and 12 July, 2007 in the U.K. David Yates made his directorial debut for the series, as did Michael Goldenberg for writing and David Barron for producing, while David Heyman returned from the first four films to produce. Reprising their roles from the previous films are Daniel Radcliffe, Rupert Grint, Emma Watson, Robbie Coltrane, Ralph Fiennes, Michael Gambon, Brendan Gleeson, Richard Griffiths, Jason Isaacs, Gary Oldman, Alan Rickman, Fiona Shaw, Maggie Smith, David Thewlis, Emma Thompson, David Bradley, Warwick Davis, Tom Felton, Robert Hardy, Julie Walters and Mark Williams, while Helena Bonham Carter, Imelda Staunton, George Harris and Natalia Tena make their debut for the series. This will sound glib, but it’s somewhat true: They asked me on the wrong day. \"[1]\nIn the wake of Cedric Diggory's death and Lord Voldemort's return, Harry Potter is worried that things could get worse. As he and his cousin Dudley are walking home from the park (following Dudley's antagonising Harry in front of his friends), they are attacked by Dementors (secretly sent by Dolores Umbridge) and Harry casts a Patronus Charm to save them both from the Dementor's Kiss. An extremely baffled Dudley is taken back to Privet Drive accompanied by Mrs Figg, a squib who is a neighbour of Harry and was told by Dumbledore to keep an eye on him. Later, a Howler from Mafalda Hopkirk of the Ministry arrives for Harry and tells him he is expelled from Hogwarts School of Witchcraft and Wizardry for using magic in front of a Muggle. The Order flies him to 12 Grimmauld Place to stay, where he finds out that Hermione and Ron's family are there, too. Harry also has many nightmares about the events that had happened the previous year, including the death of Cedric Diggory and the rejuvenation of Voldemort."
 },
 "cerberus langarm": {
  "link": "http://harrypotter.fandom.com/wiki/Cerberus_Langarm",
  "summary": "[5]\nSometime after his seventeenth birthday, Cerberus joined the Ministry of Magic in London, where he worked as an Officer in the Department of Magical Law Enforcement. [6] Having undergone the three year long training programme required to join to Auror Office and successfully passed the character and skill requirements needed to join the ranks of the official Dark Wizard catchers in the Ministry's employ, in the time that followed Cerberus fought and captured Dark wizards alongside among others Harry Potter, Mordecai Berrycloth, Dorian Fungbury and Penelope Fawley, and became a celebrated Auror himself. [2]\nIn less dangerous times with a low amount of dark magical activity to combat, however, Aurors would also be tasked with patrolling the perimeters of magical creature reserves to ward off poachers;[7] and at least some of them, Cerberus among them, deemed the task of handling himself around magical creatures to be less dangerous than what he usually did. [9]\nAt one point, he also worked as something of a liaison officer between the Department of Magical Law Enforcement and the Beast Division in the Department for the Regulation and Control of Magical Creatures, to whom he passed on intelligence regarding reports of creature-related incidents. On at least some occasions, he would lend his authority as a lawman to Mathilda Grimblehawk and her partner; accompanying them to the scene of creature-related incidents to secure areas where wild beasts was believed to be located in order to prevent further injuries,[1] and assisted them by making investigative inquiries, and by retrieving and examining evidence for them. [10]\nIn 2019, he hosted the Forum Quorum, where his advice on the health benefits of proper rest before and after battle benefited at least some members of the Statute of Secrecy Task Force in attendance. [11]\nKnown to take great pride in his position as an officer of the Department of Magical Law Enforcement, Cerberus Langarm is a diligent, tough-minded individual, known to take his duties seriously and maintained an overall professional and largely courteous demeanour."
 },
 "harry potter and the chamber of secrets": {
  "link": "http://harrypotter.fandom.com/wiki/Harry_Potter_and_the_Chamber_of_Secrets",
  "summary": "Harry Potter and the Chamber of Secrets, by J. K. Rowling, is the sequel to Harry Potter and the Philosopher's Stone. \"For Séan P. F. Harris, getaway driver and foul-weather friend\"\nEscape came in the form of a new pupil at Wydean Comprehensive, Sean Harris, who quickly became a firm friend. In 1982, he drew up outside the family home in his blue Ford Anglia and whisked Jo Rowling away from the grim stillness of Tutshill to the concerts and bars of Bristol. Harris’s blue Ford Anglia would become immortalised in Rowling’s fiction as Ron Weasley’s family car and he would be described in the dedication in her second book as \"getaway driver and foul weather friend\". \"Ever since Harry Potter had come home for the summer, the Dursleys had been so mean and hideous that all Harry wanted was to get back to the Hogwarts School of Witchcraft and Wizardry. But just as he is packing his bags, Harry receives a warning from a strange impish creature who says that if Harry returns to Hogwarts, disaster will strike. For in Harry's second year at Hogwarts, fresh torments and horrors arise, including an outrageously stuck-up new professor and a spirit who haunts the girl's bathroom. But then the real trouble begins - something is attacking Hogwarts students, making them rigid like statues."
 },
 "sage bragnam": {
  "link": "http://harrypotter.fandom.com/wiki/Sage_Bragnam",
  "summary": "[2]\nBorn into a family of unverified magical pedigree, Sage Bragham was born in Scotland and attended Hogwarts School of Witchcraft and Wizardry during his formative years where he was sorted into Ravenclaw House. [3] He was a good student, and took a particular interest in more theoretical studies, such as History of Magic and the Study of Ancient Runes, both of which he would later specialise in as an adult. Eventually, he found employment at the British Ministry of Magic, where he was hired by the Ministry's research wing and assigned to the Department of Magical Artefacts, where he would eventually rise to the position of Head Curator. Due to his knowledge on magical creatures, he would also occasionally be called on to assist with the investigations into creature-related incidents by the Beast Division in the Department for the Regulation and Control of Magical Creatures. Greatly impressed by the man's skill in rune translation and ancient languages, Mr. Bragnam, who decided that he were being wasted with the Aurors, tried to have him transferred to his own department; only to learn, to his dismay, that his wife had already persuaded him to pursue a career as an Unspeakable in the Department of Mysteries. [6]\nAfter five prominent members of the magical community in Great Britain went mysteriously missing in 2015, Mr. Bragnam lent his expertise to the efforts being made to find them by joining the council that oversaw the search lead by the Head of the Auror Office, Harry Potter..[6][7] After several months without any results, even after the lead Auror on the case had even borrowed creatures from the Magizoologist Mathilda Grimblehawk in the Beast Division, the Ministry came under a lot of pressure to find them. Still and all, it would take at least a couple of years before the Ministry decided to hold a Public Hearing to discuss a motion to terminate the London Five investigation; during which Grim Fawley, the husband of one of the missing individuals; made a stirring speech where he urged the Ministry to keep the investigation open."
 },
 "harry potter and the order of the phoenix video game": {
  "link": "https://harrypotter.fandom.com/wiki/Harry_Potter_and_the_Order_of_the_Phoenix_(video_game)",
  "summary": "A press release made by EA Games on 21 November, 2006 gave a first glimpse of the characters in Harry Potter with the Next Generation graphics as well as an idea of what the game will be like. The game has been released for the Nintendo Wii, Xbox 360, PlayStation 3, PlayStation 2, PlayStation Portable, Nintendo DS, Game Boy Advance, and PC/MAC. [1]\nThe following are available only during one mission:\nThe following is only playable during two missions:\nPlaystation Portable System (PSP) players have the opportunity to play as dark characters such as Lord Voldemort, Bellatrix Lestrange, and as a member of the Inquisitorial Squad (Draco Malfoy, Crabbe & Goyle etc.) There are many rooms in Hogwarts:\nThere are nineteen spells in the game, all classified under Environmental and Combat (13 spells for combat and 6 spells for the environment). The following spells are in the game:\nThese spells are used to work out all the tasks around Hogwarts and the other locations. The following creatures are in the game:\nThe following items are in the game:\nThese mini games are available to be played:\nIn the game you will do different things that Portraits ask you to do (after you talk to them) to learn their passwords and gain access to shortcuts. The passwords in the game are:\nThe Wii version of this game was not available until July 21st, 2007, in conjunction with the movie release, according to EA Games. The Wii version of the game is different from the other versions as you will need to use the Wii Remote to cast spells by waving it with the appropriate wrist movements to cast a spell correctly."
 },
 "tom riddle": {
  "link": "https://harrypotter.fandom.com/wiki/Tom_Riddle",
  "summary": "Tom Marvolo Riddle (31 December 1926[17] – 2 May 1998), later known as Lord Voldemort or, alternatively as You-Know-Who, the Dark Lord, or He-Who-Must-Not-Be-Named was an English half-blood[3] wizard considered to have been the most powerful and dangerous Dark Wizard of all time. The only child and son of Tom and Merope Riddle (née Gaunt), Riddle was raised in the Muggle-run Wool's Orphanage after his father abandoned his new family on the streets of London when the potion's influence was lifted, and his mother died moments after giving birth to and naming him after his father and maternal grandfather, Marvolo Gaunt. Some of his early activities included the opening of Salazar Slytherin's Chamber of Secrets and the use of its monster to attack Muggle-born students, several months' service as a purchasing agent for the Dark artefacts shop Borgin and Burkes, use of the ability to speak Parseltongue, and the attainment of immortality between the years of 1943 and 1998, a process begun upon the creation of his first Horcrux at the age of sixteen. He commanded a veritable army of wizards and Dark creatures, committed countless murders and atrocities personally and through his followers, and on one occasion nearly succeeded and on a later occasion did succeed in taking over the Ministry of Magic, installing a puppet Minister, Pius Thicknesse, who was controlled with the Imperius Curse. He was finally killed by his own backfiring curse after Albus Dumbledore and Harry Potter, following Dumbledore's death, succeeded in destroying all of his Horcruxes. Unknown to most, however, Voldemort's legacy and bloodline would live on through his daughter Delphini, whom he conceived with his loyal follower Bellatrix Lestrange; sometime after the Battle of the Department of Mysteries in 1996 and before Voldemort's death at the hands of Harry in 1998. Riddle's broken and mutilated soul was then trapped in Limbo for eternity, unable to move on to the afterlife or even return as a disembodied spirit. By Harry Potter's time, Tom's family on his mother Merope's side were the last known members of the House of Gaunt."
 },
 "harry potter a popup book": {
  "link": "http://harrypotter.fandom.com/wiki/Harry_Potter:_A_Pop-Up_Book",
  "summary": "Described as being \"based on the film phenomenon\", the book features a pop-up look at various locations and events within the Harry Potter films. The text of the book includes a number of behind-the-scenes facts regarding the films from various individuals involved in their creation, including the producers, actors and J. K. Rowling. Extras included with the book are a model of Molly Weasley's Howler to Ronald Weasley as presented in the film of Harry Potter and the Chamber of Secrets, as well as three posters:\nThe book is available for order on Amazon."
 },
 "community guidelines": {
  "link": "https://harrypotter.fandom.com/wiki/Help:Community_guidelines",
  "summary": "It's good for each community to work out and set general guidelines for how they work together. There are some common guidelines, such as being polite or not vandalizing articles, that are standard on most sites, but a community may want to add in specific points that fit their project and its contributors. Many of the common guidelines are similar to those found in any community, whether it's offline or online, a social club, gaming guild, or sports team. Note that the wiki should also have rules and a blocking policy, which serve a different purpose than the guidelines, but they do complement the guidelines. We strongly encourage communities to create their own specific guidelines and rules that fit their community and topic, but you're welcome to copy the examples below, or link to the Community Central Guidelines as a starting point for your community. Wikis are based on the idea that the crowd, collectively, has a greater sum of knowledge than just one individual. Collaboration means you work together to build, design, and make decisions."
 }
}